{
  "house": "national_assembly",
  "date": "2025-06-24",
  "start_time": "14:30:00",
  "end_time": null,
  "parliament_number": "THIRTEENTH PARLIAMENT",
  "session_number": "Unknown Session",
  "session_type": "Regular Sitting",
  "speaker_in_chair": "[The Speaker (Hon. Moses Wetang’ula) in the Chair]",
  "sections": [
    {
      "section_type": "REPUBLIC OF KENYA",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "THE HANSARD",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "VOL. IV NO. 56",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "THE HANSARD",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "PRAYERS",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "QUORUM",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Serjeant-at-Arms, ring the Quorum Bell.",
          "procedural_notes": ["(The Quorum Bell was rung)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Members, we now have a quorum. Clerk-at-the-Table.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "PAPERS",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to lay the following Papers on the Table: 1. Submission of nominees for the National Government Constituencies Development Fund (NG-CDF) Committees for the following 10 constituencies: (a) Balambala (b) Bomet Central (c) Isiolo North (d) Kisumu East (e) Laisamis (f) Makueni (g) Mathare (h) Sabatia (i) Saku (j) Bomachoge Chache. 2. Report of the Auditor-General and financial statements of Kitutu Masaba Technical and Vocational College for the year ended 30th June 2022 and the certificates therein. 3. Report of the Auditor-General and financial statements for the year ended 30th June 2023 and the certificates therein in respect of: (a) Siaya Institute of Technology (b) West Mugirango Technical and Vocational College The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "4. Reports of the Auditor-General and financial statements for the year ended 30th June 2024 and the certificates therein in respect of: (a) Bomet Central Technical and Vocational College (b) Kajiado West Technical and Vocational College (c) Kimasian Technical and Vocational College (d) Kinango Technical and Vocational College (e) Kipsinende Technical Training Institute (f) Kituma Secondary School (g) Kwale High School (h) Matuga Girls High School (i) Mazeras Girls Memorial Secondary School (j) Mazeras High School (k) Mwatate Technical and Vocational College (l) Waa Girls Secondary School (m) West Mugirango Technical and Vocational College Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Chairperson, Budget and Appropriations Committee. Where is Hon. Atandi?",
          "procedural_notes": ["(Hon. Kimani Ichung’wah spoke off the record)"]
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, on behalf of the Chairperson of the Budget and Appropriations Committee, allow me to lay the following Papers on the Table: Report of the Budget and Appropriations Committee on its consideration of the Third Supplementary Estimates for the Financial Year 2024/2025 and the compendium of Departmental Committee Reports on their consideration of the Supplementary Estimates. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Vice-Chairperson, Constitution Implementation Oversight Committee. Who is it? Hon. Kamket.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to lay the following Paper on the Table: Second Report of the Constitution Implementation Oversight Committee on the status of implementation of the Constitution by: 1. The Office of the Controller of Budget. 2. The Commission on Revenue Allocation. 3. The Office of the Auditor-General.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Chairperson, Public Debt and Privatisation Committee. Yes, Hon. Mrembo.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Bahati, JP",
          "speaker_role": "Hon. Irene Njoki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to lay the following Paper on the Table: The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Bahati, JP",
          "speaker_role": "Hon. Irene Njoki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Report of the Public Debt and Privatisation Committee on its consideration of the Consolidated Fund Services for the Supplementary Estimate III for the Financial Year 2024/2025.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Chairperson, Departmental Committee on Finance and National Planning, Hon. Kuria Kimani.",
          "procedural_notes": [
            "(Hon. Kuria Kimani consulted with several Members)"
          ]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Discontinue your conversation and do your work.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to lay the following Papers on the Table: Reports of the Departmental Committee on Finance and National Planning on its consideration of: 1. The Virtual Asset Service Providers Bill (National Assembly Bill No.15 of 2025) 2. The ratification of the Agreement establishing the European Bank for Reconstruction and Development (EBRD). Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Next Order.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "NOTICES OF MOTIONS",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "ADOPTION OF REPORT ON THIRD SUPPLEMENTARY ESTIMATES FOR 2024/2025 FINANCIAL YEAR",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to give notice of the following Motion:",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "THAT, the House adopts the Report of the Budget and Appropriations Committee on its consideration of the Third Supplementary Estimates for the Financial Year 2024/2025, laid on the Table of the House on Tuesday, 24th June 2025; and pursuant to the provisions of Article 223 of the Constitution, Section 39 of the Public Finance Management Act, Cap 412A and Standing Order 243- 1. Approves an increase of the current expenditure for FY 2024/2025 by Ksh39,114,991,340 in respect of the Votes contained in the FIRST SCHEDULE; 2. Approves a decrease of the total capital expenditure for FY 2024/2025 by Ksh3,378,082,314 in respect of the Votes contained in the FIRST SCHEDULE; 3. Approves an overall increase in the total budget for FY 2024/2025 by Ksh35,736,909,026 in respect of the Votes contained in the FIRST SCHEDULE; 4. Approves the expenditures under Article 223 of the Constitution as contained in the FOURTH SCHEDULE; and The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "5. Resolves that the FIRST SCHEDULE forms the basis for the introduction of the Supplementary Appropriation (No.2) Bill, 2025. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. The Chairperson of the Constitutional Implementation Oversight Committee.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "STATUS OF IMPLEMENTATION OF THE CONSTITUTION",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to give notice of the following Motion: THAT, this House adopts the Second Report of the Constitutional Implementation Oversight Committee, laid on the Table of the House on Tuesday, 24th June 2025 on the status of implementation of the Constitution by – 1. The Office of the Controller of Budget; 2. The Commission on Revenue Allocation; and, 3. The Office of the Auditor General. Thank you, Hon. Speaker. While on this, allow me to say something that is a little bit different.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "What is it that you want to say?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I noticed in the mainstream print media that my name has been splashed in headline news as a warmonger. While I will not be intimidated by the media, allow me to say that the events ….",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order, Hon. Kamket. I will give you an opportunity during Statement Time, which is the next order. Take your seat. Next is the Chairperson of the Public Debt and Privatisation Committee.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "CONSOLIDATED FUND SERVICES FOR THE SUPPLEMENTARY ESTIMATES III FOR FY 2024/2025",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Bahati, JP",
          "speaker_role": "Hon. Irene Njoki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to give notice of the following Motion: THAT, this House adopts the Report of the Public Debt and Privatisation Committee on its consideration of the Consolidated Fund Services for the Supplementary Estimates III for FY 2024/2025, laid on the Table of the House on Tuesday, 24th June 2025. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Next is the Chairperson of the Departmental Committee on Finance and National Planning. Member of Parliament for Molo Constituency, give your notice of Motion.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "RATIFICATION OF THE AGREEMENT ESTABLISHING THE EUROPEAN BANK FOR RECONSTRUCTION AND DEVELOPMENT",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to give notice of the following Motion: THAT, this House adopts the Report of the Departmental Committee on Finance and National Planning on its consideration of the Ratification of the Agreement Establishing the European Bank for Reconstruction and Development, laid on the Table of the House on Tuesday, 24th June 2025, and pursuant to the provisions of section 8(4) of the Treaty Making and Ratification Act, CAP 4D, approves the Ratification of the Agreement Establishing the European Bank for Reconstruction and Development. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Next order.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "QUESTIONS AND STATEMENTS",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Kamket, I give you two minutes to give a personal statement.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "PERSONAL STATEMENT",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I was saying that I, Hon. William Kamket, the Member for Tiaty, am a Prince of Peace.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Do you know what “Prince of Peace” means?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes, you are looking at one. I am indeed a Prince of Peace.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "You are not.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, the Kamket they are referring to is a different Kamket; Kamket of the media.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order, Kamket. Call yourself a peace-loving Member. You are not a Prince of Peace.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I am a peace-loving Kenyan and, indeed, a Prince of Peace. I insist.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order. Strike out the words “Prince of Peace” from the Hansard. You are not.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. I am a peace-loving Kenyan.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "That is okay.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. While I shall not be intimidated, it is on record, and it shall remain on record, that the events of the 25th of June last year were nothing other than an attempted civilian coup led by none other than the former Deputy President, whom we impeached in this House. The activities they are now planning to commemorate, which amount to the attempted overthrow of our constitutionally elected Government, shall not be tolerated by all peace-loving Kenyans.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order, Hon. Kamket. What was in the papers?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "There is an attempt by the print media…. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Just listen to your Speaker, because I read all the papers studiously. By 4.00 a.m., I had read all of them. What they said of you is that you are a warmonger and that you are spewing out hate material against people in the country. So, limit yourself to that.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Tiaty, KANU",
          "speaker_role": "Hon. Kassait Kamket",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes. Indeed, the real inciters to hatred in this country are the media, especially the print media. They are the ones who have been inciting our youths by bringing up issues that are foreign to them. They are trying to negatively portray leaders who speak out against what is happening or what is being planned, and casting them in bad light. They are attempting to intimidate leaders. I am standing in this House to state that what happened last year was indeed an attempted civilian coup, and it shall be stated as such. I shall continue saying so. Those who are planning to bring our children to the streets tomorrow are the people we are addressing. We are telling them that they shall not escape the rule of law, whoever they may be. Trying to intimidate peace-loving Kenyans like myself is an effort in futility. They shall not succeed, and they will not succeed at any time. These people are inciters. They are the worst inciters that this country has ever witnessed, and we shall call them out for who they are. As the Member of Parliament for Tiaty, I am a peace-loving Kenyan, and I shall ensure that any Kenyan demonstrating peacefully shall return home safely. However, anyone who comes with the intention of destroying the property of others, or who arrives with the intention of disturbing the peace, shall be met with the full force of the law. It cannot be right that those who incite the youth go scot-free and when we call them out, we are labelled warmongers. That shall not be allowed.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Point made. Hon. Machua Waithaka, Member of Parliament for Kiambu Constituency.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "REQUESTS FOR STATEMENTS",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "DISAPPEARANCE OF MR REUBEN BARUA IN USA",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Kiambu, UDA",
          "speaker_role": "Hon. John Waithaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, pursuant to the provisions of Standing Order 44(2)(c), I request for a Statement from the Chairperson of the Departmental Committee on Defence, Intelligence and Foreign Relations regarding the disappearance of Mr Reuben Barua, a Kenyan, in the United States of America (USA). On 13th May 2025, Mr Reuben Barua of Identity Card Number 550886 and his wife, who reside in Ndumberi in Kiambu Constituency, travelled to the State of Alabama in the USA to visit their son. Upon arrival on 14th May 2025, Mr Barua fell ill and his son took him to receive medical attention at a nearby hospital. However, the following day, on 15th May 2025, Mr Barua reportedly left the house for a walk and has not been seen or heard from since then. The matter was reported to the Calera Police Station in Alabama. It has now been over 4 weeks since his disappearance, yet no substantial update has been communicated to the family regarding the progress of investigations. This has left the family in a state of uncertainty and distress. The situation has also raised concerns about the safety and well- being of Kenyans abroad, as well as the effectiveness of our diplomatic interventions in such instances. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kiambu, UDA",
          "speaker_role": "Hon. John Waithaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "It is against this background that I request for a Statement from the Chairperson of the Departmental Committee on Defence, Intelligence and Foreign Relations on the following: 1. A report on the status of investigation into the disappearance of Mr Reuben Barua in the USA; 2. Measures being undertaken by the Ministry of Foreign and Diaspora Affairs to assist in locating the whereabouts of Mr Barua, including coordination with U.S. authorities and provision of regular updates to his family; and, 3. Long-term strategies taken by the Government to enhance the safety and welfare of Kenyans travelling abroad. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": "Rtd",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Chairperson of the Departmental Committee on Defence, Intelligence and Foreign Relations. Hon. Major (Rtd) Bashir, you are the Vice Chair, right?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Mandera North, UDM",
          "speaker_role": "Hon. Major (Rtd",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "I know we are breaking for recess on Thursday but because of the importance of the matter, try and furnish the Honourable Member with some written response in two weeks’ time. We can then mention the matter when we resume.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Mandera North, UDM",
          "speaker_role": "Hon. Major (Rtd",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Chair. I am well guided; we shall do so. Within two weeks, we will be able to give him a response and formally bring it to the House after recess.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Hon. Ekwom Nabuin.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "STATUS OF INVESTIGATION OF TODONYANG MASSACRE",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Turkana North, ODM",
          "speaker_role": "Hon. Paul Nabuin",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, pursuant to the provisions of Standing Order 44(2)(c), I request for a Statement from the Chairperson of the Departmental Committee on Defence, Intelligence and Foreign Relations regarding the status of investigation into the Todonyang Massacre. On 22nd February 2025, armed assailants believed to be members of the Dassanach militia from the neighbouring country of Ethiopia carried out a brutal cross-border attack on the villages of Lotiira and Lopeimukat villages, in Todonyang Location, Turkana County. The attackers targeted innocent civilians, mainly fishermen and small-scale traders, leading to the loss of more than 30 Kenyans and the destruction of critical fishing equipment. In addition, the attack left many families grieving the loss of their loved ones and without their primary means of livelihood. Despite this tragic incident, similar deadly attacks have continued to occur within Kenyan territory, raising serious concerns about the security of the people at the border and underscoring the need for swift action to be taken. It is against this background that I request for a Statement from the Chairperson of the Departmental Committee on Defence, Intelligence and Foreign Relations on the following – 1. A report on the status of investigations into the Todonyang massacre that occurred on 22nd February 2025, including the steps taken to collaborate with Ethiopian authorities to apprehend the culprits. 2. The measures put in place to address security breaches at the Kenyan border along Lake Turkana and confirmation of whether security forces have been deployed to ensure the protection of Kenyans at the border. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Turkana North, ODM",
          "speaker_role": "Hon. Paul Nabuin",
          "speaker_url": null,
          "speaker_details": null,
          "content": "3. Steps taken by the Ministry of Defence through the Kenya Defence Forces to protect the fishermen along Lake Turkana during their fishing expeditions. 4. Measures put in place to ensure that the families of the victims are compensated, and an indication of when they will receive their compensation. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Hon. Bashir.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Mandera North, UDM",
          "speaker_role": "Hon. Major (Rtd",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I have heard the Request of Statement. The incident of 22nd February 2025 was very unfortunate. I will equally say the same as on the response given earlier. We will give the Member a written submission in two weeks' time and formerly respond to the Request in the House upon resumption from recess.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "STATEMENT",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Responses? Hon. Bashir, again. You will respond to a Statement Request by Hon. Jane Kagiri, Member of Laikipia. Is Jane Kagiri in the House? The questioner is not in the House. To be fair to her, we can stay the Statement response. We can deal with it if she comes before the end of Statement time.",
          "procedural_notes": ["(Response to Statement request deferred)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Departmental Committee on Transport and Infrastructure, you have a Response to a Statement request by Hon. Joseph Gitari. Is he in the House? Yes, he is. Hon. GK, go ahead.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "CONSTRUCTION AND REHABILITATION OF ROADS IN KIRINYAGA CENTRAL CONSTITUENCY",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Ndia, UDA",
          "speaker_role": "Hon. George Kariuki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, the Member for Kirinyaga Central, Hon. Joseph Gitari, requested for a Statement from the Chairperson of the Departmental Committee on Transport and Infrastructure regarding the status of construction and rehabilitation of roads in Kirinyaga Central Constituency. He sought to, among other things, establish: 1. The status of the following road projects in Kirinyaga – (a) Kiamuthambi-Gatuto Road. (b) Kagumo-Kangaira Road. (c) Kerugoya Prisons-Kimandi Road. (d) Kerugoya Girls-Kandakame Road. (e) Kibingo-Kiratina Road. (f) Mungetha-Gitumbi-Mugwandi Road. (g) Mutira-Kagumo-Kiamaina-Gathuthuma-Kianjagi Road. 2. The report on the status of the rehabilitation works of the following roads– (a) Gakoigo-Kianderi-Kangatia Road. (b) Miringa-iri-Kiawakara Road. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Ndia, UDA",
          "speaker_role": "Hon. George Kariuki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "3. Interventions by the ministry to ensure the completion of these projects, including specific completion dates. The Committee received a response from the Ministry of Roads and Transport on 14th May 2025, which I now wish to make. Regarding the status of the Kiamuthambi-Gatuto Road, the Kerugoya Girls- Kandakame Road, and the Mungetha-Gitumbi-Mugwandi Road, the Ministry submitted that these roads are in the Project Contract No.RWC 286 under Jiangxi Water Hydropower Construction Company Limited as the contractor. The roads are currently incomplete because the contractor suspended work since October 2022 due to none payment of Ksh383,356,919.10 that was due to them. The original completion date was 4th October 2020. The revised project completion date was 1st May 2022. The current project’s physical progress is at 85.5 per cent against 160.90 per cent time lapse. The Ministry further submitted that: 1. Kiamuthambi-Gatuto Road, covering 2.68 kilometres, stalled after completion of the base layer construction. 2. The Kerugoya Girls-Kandakame Road, covering 1.96 kilometres, has been halted after the first seal surface layer was laid, with a 100-metre section remaining unconstructed due to unresolved wayleave issues. 3. The Mungetha-Gitumbi-Mugwandi Road, covering 3.818 kilometres, has similarly stalled following the completion of its base layer construction. All these three projects currently remain incomplete, with work suspended at various stages of development. Regarding Kagumo-Kangaira Road, the Ministry submitted that this road link is in the project contract No.RWC 621 under China Wu Yi Company Limited as the contractor. A section of 4.2 kilometres along the road is complete, with the remaining 2.75 kilometres incomplete. The contractor has not been on site since December 2024 due to delayed payment of Ksh141, 490,725.38. The original completion date was 26th July 2024. The current project’s physical progress is at 31.85 per cent against 120.99 per cent time lapse. Regarding the Mutira-Kagumo-Kiamaina-Gathuthuma-Kianjagi Road, the Ministry submitted that these roads are in the Project Contract No.RWC 549 under China Wu Yi Company Limited as the contractor. A section of 6.56 kilometres along Mutira-Kagumo is complete, with the remaining 10.79 kilometres incomplete. There are no ongoing works because the contractor suspended work since November 2024 due to delayed payments amounting to Ksh290,570,283.83. The original completion date was 2nd July 2022. The revised project completion date was 12th February 2024. The current project’s physical progress is at 69.84 per cent against 120.46 per cent of time elapsed. Regarding Kerugoya Prisons-Kimandi and Kibingo-Kiratina Roads, the Ministry stated that the two roads are under the county government’s jurisdiction. Regarding the status of rehabilitation works for Gakoigo-Kianderi-Kangatia Road, which is 13.08 kilometres, the Ministry submitted that the road project forms part of Project Contract No.RWC 286 under Jiangxi Water Hydropower Construction Company Limited. The roads shall be rehabilitated by the contractor upon the scheduled resumption of works. On Miringa-iri-Kiawakara Road, the Ministry submitted that this road was constructed under the R2000 programme, which was completed in January 2021. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Ndia, UDA",
          "speaker_role": "Hon. George Kariuki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Rehabilitation of this road has been factored into the RMLEF 10 per cent funding for the financial year 2024/2025. The original completion date for the project was 21st January 2021. The project is 100 per cent complete. Regarding interventions by the Ministry to ensure completion of these projects, including specific completion dates, the Ministry submitted to communicate the specific completion dates for the stalled projects through the Kenya Rural Roads Authority (KeRRA). That is upon resolution of the funding challenges that have caused the slowing down or complete withdrawal of contractors from site. Towards this end, the Ministry has made requests for enhanced annual budgetary allocations to enable offsetting the enormous pending bills owed to contractors for road works certified countrywide, including those in Kirinyaga County. In addition, the Ministry has initiated several interventions towards settling pending bills. This includes actively exploring alternative financing initiatives and seeking support from development partners. Hon. Speaker, I submit.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Gitari, are you satisfied with the response so that we can move on?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kirinyaga Central, UDA",
          "speaker_role": "Hon. Joseph Gitari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I am not fully satisfied. I sympathise with my friend and neighbour, Hon. G.K. because he was not the author of this reply. My request for a Statement was specific. One of the questions that I asked was the actual completion date, not the previous completion date that was indicated as 2024. The President launched the Mutira-Kagumo-Kiamaina-Gathuthuma Road and I thought money had been allocated for its construction. The people of Kirinyaga are still waiting for that road. The Kerugoya Girls-Kandakame Road has been under construction for a very long time. I was hoping that the Chairperson of the Committee consulted the Ministry. This is because he comes from the same zone.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. G.K. have you brought an inappropriate answer?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Ndia, UDA",
          "speaker_role": "Hon. George Kariuki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I know these roads not just by name, but by location. I have used these roads in Kirinyaga County.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Is your Statement factual?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Ndia, UDA",
          "speaker_role": "Hon. George Kariuki",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, my Statement is factual in as far as the funding challenge is concerned. That is the main point. It is not about the timelines but availability of resources to complete those projects. I also want those projects completed because I am Hon. Gitari’s county mate. We will do our best to support him, the people of Kirinyaga and by extension, the people of Kenya. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. We will go to the next response. Is Hon. Josses Lelmengit in the House? He is not in the House. Is Hon. Jane Kagiri in the House?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Gilgil, UDA",
          "speaker_role": "Hon. Martha Wangari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "On a point of order, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes, Hon. Wangari.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Gilgil, UDA",
          "speaker_role": "Hon. Martha Wangari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. Before you exit that Order, I would like to remind you that last Thursday, I requested for a Statement on gambling from the Chairperson of the Departmental Committee on Finance and National The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Gilgil, UDA",
          "speaker_role": "Hon. Martha Wangari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Planning. You instructed that I write to your Office, which I did. Maybe you can give direction on that matter so that I know the way forward before we go on recess.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "I directed the Clerk to ask the Chairperson of the Departmental Committee on Finance and National Planning to bring a response. Chairperson, will you be able to bring a response tomorrow or on Thursday?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker, for your indulgence. I apologise to Hon. Martha Wangari for the delay. As you are aware, there were several other businesses that were referred to my Committee. However, we will do our best to bring a response by Thursday.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "I did not put any pressure on you. This is because I knew the load of business that was before you. Can you bring a response on Thursday?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I will do so on Thursday.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Responses to requests for Statements by Hon. Jane Kagiri, Member for Laikipia County and Hon. Josses Lelmengit will be stayed until Thursday. Hopefully, the Members will be present. Major Bashir and Hon. G.K. be ready for Thursday.",
          "procedural_notes": [
            "(Responses to requests for Statements by Hon. Jane Kagiri and Hon. Josses Lelmengit deferred)"
          ]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Before the Leader of the Majority Party moves the next Motion, allow me to make a Communication.",
          "procedural_notes": ["(Several Members stood along the gangways)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order Members on their feet. Take your seats. Hon. Richard, take your seat.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "COMMUNICATION FROM THE CHAIR",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "DELEGATION FROM THE BICAMERAL LEGISLATURE OF NIGERIA",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. On behalf of the House, allow me to take this opportunity to welcome the delegation from the Federal Republic of Nigeria. As you heard, Members welcomed them while saying “Igwe” as you called out their names. Karibu to Kenya. May you take your time to learn as much as you can.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, many African countries can learn from Kenya and the Republic of Rwanda about women representation in parliament. Since Kenya has a universal suffrage system of election of women leaders, it is a better place to learn from rather than countries where the system is party based. Therefore, this delegation is in the right place. I hope the Chairperson of the caucus of the 47 Women Representatives will also get time to engage with this delegation so as to guide them on the amendments they can enact in their legislation. Hon. Speaker, with that, allow me to…",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Before you do so, I have been requested by Hon. Wangari that she lend her voice of welcome and support.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Gilgil, UDA",
          "speaker_role": "Hon. Martha Wangari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. On behalf of yourself and the panel today, led by the Deputy Speaker, we hosted the delegation for an intense one-and-a half hour discussion. We learnt a lot from each other. More importantly, as the Leader of the Majority Party has said, they can copy a lot from our country. In the Nigerian Senate out of 109 Members, only four are women. In the House of Representatives out of 360 Members, only 16 are women. In total, they only have 4 per cent representation of women. This is the right place to benchmark. We shared a lot in terms of the legislation we have put in place and the constitutional journey this country has travelled to get to where we are.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Gilgil, UDA",
          "speaker_role": "Hon. Martha Wangari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I know, they will be here for a few more days. They will have a meeting with the Kenya Women Parliamentarians (KEWOPA) on Thursday. So, as to further exchange notes on how we can help them develop a legal framework for their country we are happy to always welcome them back to this country. Thank you, Hon. Speaker. I appreciate.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Leader of the Majority Party, you can now proceed with your Motion. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. Before I move, it is also important to note as Hon. Martha Wangari has said, that we also came from where Nigeria is today. There was a time when there were very few elected women Members of Parliament in this country.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "When I first came to this Parliament in 1992, there were three elected women.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Including Hon. Wanjiru from Kinangop.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "The prophetess.",
          "procedural_notes": ["(Laughter)"]
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Indeed, it has been a long walk to get to where we are. I hope that the Republic of Nigeria, as African powerhouse in the western part of the continent, just as Kenya is in Eastern Africa, will lead from the front. Africa is better with more women representing their people in both the Legislature and Executive.",
          "procedural_notes": ["(Applause)"]
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "We look forward to a time when Nigeria and Kenya will have women presidents leading our two great countries. I hope we will see this in our lifetime. We have very many capable women in this House who can be future presidents of this Republic after the 10 years of President William Ruto.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "PROCEDURAL MOTION",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "EXTENSION OF SITTINGS AND RESOLUTION TO HOLD THURSDAY MORNING SITTING",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to move the following procedural Motion: THAT, pursuant to the provisions of Standing Orders 30(3)(a) and (b) (Hours of Meeting), this House resolves to— 1. extend sittings of Wednesday, 25th June 2025 (Afternoon Sitting) and Thursday, 26th June 2025 (Afternoon Sitting) to midnight for purposes of consideration of priority business ahead of the short recess; and, 2. hold a Morning Sitting on Thursday, 26th June 2025, commencing at 9.30 a.m. This Motion is pursuant to what we agreed in the House Business Committee this lunch hour so as to allow us conclude all the important business that we have before we proceed on our short recess on Thursday evening. We are proposing to slot in a Thursday morning sitting. Also, extend the sitting tomorrow and Thursday up to midnight for us to conclude all the important business. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "This includes the Supplementary Appropriations Bill, whose debate the Chairman has just given notice. The Chairman of the Departmental Committee on Finance and National Planning has just tabled the report on the Virtual Assets Service Providers Bill. We also have priority business on the Order Paper for today, tomorrow and the day after. Hon. Speaker, I beg to move and request Hon. Osoro to second.",
          "procedural_notes": []
        },
        {
          "speaker_name": "South Mugirango, UDA",
          "speaker_role": "Hon. Silvanus Osoro",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you very much, Hon. Speaker. As the Leader of the Majority Party has rightly put, looking at the calendar of this House, we will proceed on recess from Thursday. So, it is quite in order for us to dispense with the very serious business before us as we discussed in the House Business Committee. Hon. Speaker, I beg to second.",
          "procedural_notes": [
            "(Hon. Dekow Mohamed and several Members stood up in their places)"
          ]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Members on their feet, take your seats. Hon. Major Dekow take the nearest seat.",
          "procedural_notes": ["(Question proposed)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Members, do I put the Question?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Members",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes.",
          "procedural_notes": ["(Question put and agreed to)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Next Order.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "MOTION",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "REDUCTION OF THE PUBLICATION PERIOD OF A SPECIFIED BILL",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Atandi, Chairman of the Budget and Appropriations Committee.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I beg to move the following Motion: THAT, pursuant to the provisions of Standing Order 120, this House resolves to reduce the publication period of the Supplementary Appropriation (No.2) Bill (National Assembly Bill No.26 of 2025) from seven days to one day. We have roughly four days to the end of this financial year. Also, the House is going for a short recess this week. The Supplementary Appropriation Bill No.2 before this House is very short. It will regularise the expenditures which have already been incurred under Article 223 of the Constitution. So, I beg the House to shorten the publication period to one day so that we can process the Bill before the recess. Hon. Speaker, I beg to move.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Who is seconding? The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I request the Leader of the Majority Party to second.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Leader of the Majority Party.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I rise to second. As the Chairman has said, in view of the fact that we have less than four days to the end of the financial year, we need to conclude the Supplementary Appropriation Bill No.2 for this financial year so that it can be assented to before the end of the financial year. Therefore, it is important to reduce the publication period to one day. Thank you, Hon. Speaker. I second.",
          "procedural_notes": [
            "(Hon. Charles Nguna and several Members stood up in their places)"
          ]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order Members on their feet. Take your seats. Hon. CNN, take your seat.",
          "procedural_notes": ["(Question proposed)"]
        },
        {
          "speaker_name": "Hon. Members",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Put the Question!",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Do I put the Question?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Members",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes.",
          "procedural_notes": ["(Question put and agreed to)"]
        }
      ]
    },
    {
      "section_type": "BILL",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "MOTION",
      "title": null,
      "contributions": []
    },
    {
      "section_type": "CONSIDERATION OF THE FOURTH GENERATION REVENUE SHARING FORMULA FOR COUNTIES",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Atandi.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, I beg to move the following Motion: THAT, taking into consideration the findings of the Budget and Appropriations Committee in its report on the consideration of the Fourth Basis for revenue sharing for county governments, laid on the Table of the The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "House on Thursday, 19th June 2025, and pursuant to the provisions of Article 217(1) and (4) of the Constitution on allocation of the Share of National Revenue among the Counties, this House concurs with the Senate and approves the Fourth Basis for the Annual Allocation of the Share of National Revenue to the county level of government for the Financial Years 2025/2026 to 2029/2030 without amendments as follows— (i) For County Equitable Share below Ksh415 billion – County Allocation = (Baseline Allocation Ratio*Ksh.387.425 billion) + (Ksh3 billion shared equally among the identified 12 counties) + {[(0.45*Population Index) + (0.35*Equal Share Index) + (0.12*Poverty Index) + (0.08*Geographical Size Index)] *(County Equitable Share - Ksh390.425 billion)}. (ii) For County Equitable Share of Ksh415 billion and above- County Allocation = (Baseline Allocation Ratio*Ksh.387.425 billion) + (Ksh4.46 billion shared equally among the identified 12 counties) + {[(0.45*Population Index) +(0.35*Equal Share Index) +(0.12*Poverty Index) +(0.08*Geographical Size Index)] *(County Equitable Share-Ksh391.89 billion)}. Where – (i) Baseline Allocation Ratio=The allocation factor derived from each County’s allocation for the Financial Year 2024/2025; (ii) The 12 identified counties are: Elgeyo Marakwet, Embu, Isiolo, Kirinyaga, Laikipia, Lamu, Nyamira, Nyandarua, Samburu, Taita Taveta, Tharaka-Nithi and Vihiga; (iii) The Population Index is based on the 2019 Kenya Population and Housing Census (KPHC); (iv) The Poverty Index is based on the 2022 Kenya Poverty Report by the Kenya National Bureau of Statistics (KNBS); and (v) Geographical Size is capped at 10 per cent.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hold on Hon. Atandi. Hon. Members, I advised the House…",
          "procedural_notes": ["(Hon. Julius Melly stood in his place)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order, Hon. Julius. Take your seat. Whoever has any contrary view to the content of this Motion and wants to overturn it must garner 233 Members. Therefore, when it comes to voting that is the constitutional threshold. Go on, Hon. Atandi.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. What we are discussing before the House is the Fourth Basis for the national revenue sharing. Since the promulgation of the new Constitution, we have had three national revenue sharing formulas. This is the fourth. Every five years, a new formula is developed where the national revenue allocated to counties is shared among them. Many parameters have been used in the past when considering the allocation and sharing of these resources among counties. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "One of the prominent formulas used in the past is the population parameter. It was used to decide how much money goes to each county. Some counties are highly populated while others have a low population. The highly populated ones have received more allocation than those with a low population. This consideration is a very good parameter and is used in most jurisdictions like India and many other countries that have embraced devolution. If the population is high, you are likely to get more resources. The reason is that if the population is very high, you need more resources to provide services to the population.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "In Kenya, the only challenge we have with this parameter is that population census is not done regularly but after a long time. Therefore, estimating the reality of population in a particular area is becoming a very big challenge. We urge this House, that in future we have regular population census being conducted so that we are sure of the population when allocating resources to the counties.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The other parameter which has been considered here is the land area. It is an important parameter because some counties have a large land size. Accessing services becomes a problem for populations. They need more resources so that they are able to provide services to populations wherever they are. This has also been an important formula which has been considered when deciding the resources to counties. The other parameter which has been used is the poverty index. However, it has been challenged as a basis for sharing resources. This is because some counties have refused to develop or improve their poverty levels since they are sure that this parameter will be used to give them resources. So, they have chosen to remain poor. Even though this parameter has been used we urge going forward that it needs to be a lesser parameter so that counties can improve their poverty levels. Since poverty level is a parameter, most counties have refused to work hard. Some have chosen to remain poor over the years despite us pumping too many resources into them. They know that as long as they are poor, they will get more resources.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Speaker, another parameter which has also been considered is the health status of counties. Resources given to counties are supposed to help in improving livelihoods, services and facilities. Some counties have refused to graduate in provision of health services even though health is devolved. They do not employ doctors or build health facilities. They want to use this parameter to continue earning more resources in the revenue sharing of resources among counties. The Budget and Appropriations Committee agrees with this formula and the way resources have been allocated to counties especially, now that 12 counties are being considered for special allocation. We realised that the 12 counties have been unable to undertake development projects because of their sizes and the resources they receive. Under the new formula, the 12 counties will receive a special allocation. In this formula, we have a sharable allocation of Ksh15 billion. This means that the 12 counties will get more resources for development; about Ksh4.46 billion to assist them initiate development programmes. This formula is very simple. I want to thank the Senate for coming up with it. It is a result of a very consultative process. This formula will ensure that counties which have not engaged properly in development programmes will now have an opportunity to do so.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "With those remarks, I beg to move and ask my able Vice-Chairman to second.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": "Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. (Dr) Robert Pukose. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. I stand to second the Motion.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Firstly, I want to thank Hon. Chairman who led our team from the National Assembly in the discussions. I also want to thank Hon. Senator Ali Roba who led the Senate team. This formula will help us to implement the outcomes of our mediation. It is based on Ksh415 billion and every county will benefit in terms of development. Hon. Mwashako a Member of the Budget and Appropriations Committee, joked that all tall women in Taita get married outside the county, leaving the short ones behind. This is because of the amount the county gets. Hon. Haika can confirm. You know she got married in Rift Valley because she is tall. So, this formula will ensure that Taita County gets an extra Ksh300 million to enable it undertake development. The same goes to Elgeyo-Marakwet County and the others that were previously marginalised. I hope these counties will utilise those resources well. Hon. Speaker, you and I come from the western part of this country. You know what has been happening in my county of Trans-Nzoia. Resources have been disappearing with no meaningful development. Money is being stolen left, right and centre. It is embarrassing. When devolution came each county was expected to have meaningful development. With this formula, Trans-Nzoia County will get an extra Ksh100 million. I hope this money will not be stolen. By increasing the allocation, we want to see meaningful development in Endebess. What development projects has the Trans-Nzoia County Government done in Endebess, Kiminini, Saboti, Kwanza and Cherangany?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "By agreeing with this formula from the Senate and by extension from the Commission on Revenue Allocation (CRA), this means we have looked at how development can reach the ground. It will be a shame if this House appropriates funds and agrees with this formula and then the money ends up in people’s pockets. This is the most disgraceful thing that can happen. This is a good formula. We hope it will bring meaningful development in the counties. Each and every county will have money for development and not just for recurrent expenditure. Instead of using money for development, some county governments employ goons to move around from one constituency to another to intimidate Members of Parliament. I do not think that is the way we want to go as a country. I ask the Inspector- General (IG) of Police and the Cabinet Secretary, Hon. Murkomen to rein in on the goons. We should not be a country of goons. This will mean we are deteriorating and going the Haiti way, where everybody has his own militia. That is not what we want. As the Budget and Appropriations Committee, we are happy with this formula. I hope the National Assembly will pass it.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "With those few remarks, Hon. Speaker, I second.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Order, Members on their feet. Take your seats. Members at the back, take the nearest seats. Thank you.",
          "procedural_notes": ["(Question proposed)"]
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": "Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. (Dr) Ojiambo Oundo. I see your request is the first on the screen. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Funyula, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker. By your very guidance, probably debate may be rendered redundant. I do not see how we will raise 233 Members to challenge the formula.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Funyula, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I wish the Chairman of the Budget and Appropriations Committee, having deliberated and dealt with this matter, can explain to Kenyans which criteria was used to select the 12 counties. We want to understand if it was a matter of population or the poverty index. What are the social parameters that were used to select the 12 counties considering that Kenya has been independent since 1963 and has had devolution that came into effect in 2013? All of us are interested in knowing the basis. Second, Hon. Speaker, we cannot discount the question of poverty index because it is very critical. Many of my colleagues have always complained about Sessional Paper No.10 of 1965 that deliberately marginalised some parts of this country. That is an historical matter that will take many years to be resolved. Third, I expected that fiscal discipline would be awarded some marks in terms of how much a county in own-source revenue it has raised and how much it adheres to the provisions of the Public Finance Management Act to ensure there is prudent use of public resources and there is value for money. Dropping that criterion is giving the counties a blank cheque to continuously misappropriate and misuse public resources and, generally, make them lazy not to pursue their own source revenue. Many Kenyans keep on asking why Nairobi County literally requires any resources from the national Government. It is the biggest county and all the resources are here. Why would it require resources as part of the equitable share? Hon. Speaker, with those few remarks, I support. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Osoro, are you gesturing like you want to speak?",
          "procedural_notes": []
        },
        {
          "speaker_name": "South Mugirango, UDA",
          "speaker_role": "Hon. Silvanus Osoro",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you very much, Hon. Speaker. I also rise to support this Bill on the question of sharing of equitable revenue. It is about time we got a practical solution to these shareables. As we look at the national cake and how to share it across the country, we also need to ask county governments whether they are able to reach their targets in terms of their own-source revenues. Just like my colleague, Hon. Oundo has said, there are counties that really do not require such. Looking at Nairobi, for example, as a county, the amount of money it collects as own source revenue is enough to fund up to five counties by itself. They do not need any cake from the national Government and from the Exchequer. That is the debate that we need to have. Looking at the formula that has been shared by Hon. Atandi, there has been a progressive growth on what goes to devolved units. As I said earlier, we started from about Ksh320 billion or thereabouts. It then grew gradually to about Ksh385 billion. It stuck at about Ksh388 billion. We are now getting to about Ksh415 billion for the devolved units. This is a clear indication that, progressively, money is getting to people and that money is moving from the central system and going to the villages and county governments. The question we need to ask ourselves is this: is the money really getting to the people like it ought to? Does it get to the right person in the village? Does this money get used for the particular purpose that it is meant for according to the Constitution? Those are the questions that we need to ask ourselves. Going forward, this House needs to think about coming up with legislation that, perhaps, will replicate what happens at the National Government Constituencies Development Fund (NG-CDF) and apply it to county The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "South Mugirango, UDA",
          "speaker_role": "Hon. Silvanus Osoro",
          "speaker_url": null,
          "speaker_details": null,
          "content": "governments. We need to come up with a formula on how this money should be spent. It should have particular votes. For example, we could say that not more than 60 per cent of the amount should be used for recurrent expenditure or salaries. As we talk about Ksh415 billion going to the devolved units, and about 65 per cent of that amount is used for salaries and other recurrent expenditure. In their budgets, there is a lot of money for the governor's office which we cannot tell what it does. It is time this House thinks through such structures. If we are able to replicate the formula used on NG-CDF to the county governments, it will have meaningful impact on the people. As it is currently constituted, we send a blank cheque to them. We give them the entire Ksh415 billion and they have their own-source of revenue which they use the way they want. About 70 per cent of it does not impact people. That is the question we need to ask. As we talk about the formula, we should find a way to have the money trickle down to villages in a particular way with a specific vote. This will ensure we do not have a situation where some local leaders or Members of County Assemblies (MCAs) turn governors into demigods, that they have to worship and kneel before so that they can get development. That is why we are fast-tracking the Ward Development Fund so that county assemblies become autonomous. They do not need to rely on the office of the governor to have the funds. As I support this, I challenge this House to think about a legislation that will take this money to the counties with a particular vote so that particular percentages are allocated for specific votes. It should be a replica of NG-CDF. We should not let a governor decide on anything because there is no cap on what they can spend so that the money reaches the people. That is the discussion we should be having. I also challenge governors and the county governments to note that we are still struggling, even as we continue growing gradually. Today, we are at Ksh415 billion. We are still struggling. Kenyans who are watching us are also struggling to identify what these billions do in the counties and whether this huge amount of money is felt in the counties. We are still struggling to understand that. Before I sit down, I challenge counties like Nairobi, Mombasa and other big counties, whether they really need this amount from the Exchequer. Their own-source revenue is enough to fund five other counties. We need to ask ourselves that question. I was looking at Nairobi county government budget and I realised it is actually triple what Rwanda passes as a national budget. It is more than the budget of a whole country like Rwanda! Their own- source revenue is a lot. It is enough to fund many other county governments. So, as I support, these are the questions we need to ask ourselves. Do counties with big cities really require the national cake? How can we replicate the NG-CDF Act on county governments so that as we send money, it is spent on a particular vote and nobody will spend it on anything else. On the question of pending bills, we should emphasise that the vote is meant for pending bills only so that we do not need to form committees. What counties do is that immediately a new governor takes over, they form a committee that is also paid by the government, by their very own county fund, to review whether the predecessor had genuine pending bills. There should be a system that checks that and a committee should not be The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "South Mugirango, UDA",
          "speaker_role": "Hon. Silvanus Osoro",
          "speaker_url": null,
          "speaker_details": null,
          "content": "formed for that. After the committee has done its work, it is again rechecked by another committee. Those are the challenges we have as far as devolution is concerned. With those very many remarks, I still support. Thank you very much, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Osoro. Hon. Members, allow me to acknowledge the following schools before we continue with the debate. In the public gallery, we have learners from Katimoril Secondary School, Kapenguria Constituency, West Pokot County; Kianjiru-Ini Secondary School, Maragua Constituency, Murang’a County; and Thome Primary and Junior School, Gilgil Constituency, Nakuru County. On my behalf and that of the House, we welcome the students, their teachers and those accompanying them to the House of Parliament. I have been requested by the Member for Gilgil to give her one minute to acknowledge and welcome the school from her constituency and all the others.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Gilgil, UDA",
          "speaker_role": "Hon. Martha Wangari",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker, for indulging me. I take this opportunity to welcome the students in the Public Gallery. Allow me to thank you and the Clerk of the National Assembly for offering a good training ground for our children during this Session of the 13th Parliament. It is important because some of the schools you see here, especially Thome Primary School, are located near Eburu Forest in Gilgil Constituency. It is quite a privilege for them to have the opportunity to come and observe the proceedings of this House. We hope that we can continue with the same. I welcome all the students. You should know that they can be the ones sitting here tomorrow. It will be their chance. However, let them observe the proceedings and learn today. Thank you, Hon. Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Speaker",
          "speaker_role": null,
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Mwashako, Member for Wundanyi.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wundanyi, WDM",
          "speaker_role": "Hon. Danson Mwashako",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Speaker, for giving me this chance to add my comments to this Motion. The Fourth Basis for Revenue Sharing for County Governments is an encouraging step in our country. The Senate, starting with the Commission on Revenue Allocation (CRA), has captured the imagination of the country. We know that resource distribution anywhere in the world is a seriously contested issue. It is never easy to share and distribute resources to different corners of the country. When we bequeathed ourselves the new Constitution in 2010, devolution was the main theme that made Kenyans support it.",
          "procedural_notes": [
            "[The Speaker (Hon. Moses Wetang’ula) left the Chair]",
            "[The Temporary Speaker (Hon. Martha Wangari) took the Chair]"
          ]
        },
        {
          "speaker_name": "Wundanyi, WDM",
          "speaker_role": "Hon. Danson Mwashako",
          "speaker_url": null,
          "speaker_details": null,
          "content": "This formula gives hope to small counties, including Taita Taveta County. We are pleased and happy to support this formula because CRA and the Senate have agreed to put aside money that will be shared among the so-called small counties which are six. They have issues perennially because they are unable to raise enough resources to fund development of specific needs of those counties.",
          "procedural_notes": [
            "[The Temporary Speaker (Hon. Martha Wangari) left the Chair]"
          ]
        },
        {
          "speaker_name": "Wundanyi, WDM",
          "speaker_role": "Hon. Danson Mwashako",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": [
            "[The Temporary Speaker (Hon. Peter Kaluma) took the Chair]"
          ]
        },
        {
          "speaker_name": "Wundanyi, WDM",
          "speaker_role": "Hon. Danson Mwashako",
          "speaker_url": null,
          "speaker_details": null,
          "content": "These counties are Vihiga, West Pokot, Tharaka-Nithi, Lamu and Taita Taveta. When we consider only population, geographical size and poverty index, they do not capture the minimum resources wallet that is required to run a county. Therefore, when I look at this formula today, there is an attempt to set aside Ksh3 billion to be divided among the 12 counties. This gives me a lot of encouragement. I sit in the Budget and Appropriations Committee. We agreed that we would give counties more money. Today, we passed the Division of Revenue Bill that will give counties Ksh415 billion. This means that the 12 so- called small counties will get a total of Ksh4.46 billion to share amongst themselves. If you divide that by 12 counties, you realise that each county will receive in excess of Ksh370 million. The biggest challenge that we have in Taita Taveta County is healthcare. Therefore, I urge my governor, the Members of Taita Taveta County Assembly and County Executive Committee that when this money comes, they should make full use of it. It is an affirmative fund to fund the development needs of our county. They will receive Ksh370 million which they should use to fund the health budget. This is because our people are suffering. We do not have enough hospitals and equipment. We have a Level 4 Hospital in Voi that we expect to be improved to meet the standards of a Level 4 Hospital. If it is possible, we can build a proper Level 5 Hospital. The entire Ksh370 million should be used to promote health, build new facilities and equip them. Where possible, the funds should also support the health workers, in terms of remuneration. As I conclude, devolution should be protected. I stand as an advocate for protecting devolution, but I also warn a few individuals, particularly CRA. When the first formula was made, it identified 14 counties as marginalised since Independence. Today, they have increased to 33 counties. These are about 107 constituencies which are marginalised. Therefore, the money meant for marginalisation that was to be allocated to 14 counties is now being divided into very small amounts. This means it does not do any meaningful activity. The CRA should not further dilute the 12 counties that have been identified in this Fourth Basis Formula. There should never be an attempt to expand from the 12 counties to any bigger number. We know that these 12 counties require these resources, so that then they can grow in the same manner as the other big counties. I support this Motion. As Members, we should always support the small counties to get more funding. Thank you.",
          "procedural_notes": ["(Technical hitch)"]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "It is very easy to know the Members eyeing the gubernatorial seat in future. We can easily listen to them. Hon. Gideon Ochanda, the Member for Bondo.",
          "procedural_notes": ["(Laughter)"]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Bondo, ODM",
          "speaker_role": "Hon. Gideon Ochanda",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, I do not want to get into the troubles of eyeing the gubernatorial seat too early.",
          "procedural_notes": ["(Laughter)"]
        },
        {
          "speaker_name": "Bondo, ODM",
          "speaker_role": "Hon. Gideon Ochanda",
          "speaker_url": null,
          "speaker_details": null,
          "content": "As I look forward to contribute properly to this Motion, I remind myself and the entire House a number of things. Definitely, there has to be a formula, in terms of how we share resources horizontally. Besides that, as much as the Chairperson has brought us what the Senate has looked at, I believe there are many other things that are not yet looked at properly. One of these factors is the constitutional considerations that we have. There are provisions in Article 203 of the Constitution. It states the criteria that shall be taken into account in determining the equitable shares of the revenue raised nationally between the national Government and county governments. Article 203(1)(d) of the Constitution states there is the need to ensure that county governments are able to perform the functions that are allocated to them. When looking at the allocation of revenue to counties, who has ascertained or computed the county functions and their value before we allocate them resources? The other important factor that the Constitution provides, that has not been looked at, is the fiscal capacity and efficiency of county governments. The CRA needs to look at these things before we allocate money to these counties. When you consider these factors, we have counties which need be closed down. These are critical factors and constitutional provisions that we really need to look at every single time that we are allocating resources. Two months ago, we placed more money into counties in the name of additional funding. We passed a Motion and gave them more money. At what stage do we consider these additional monies allocated to counties, especially when we are doing the horizontal placement of resources? The whole issue of additional funding is a critical matter that needs to be looked at in terms of functions that the national Government is still performing on behalf of the counties. Where are those monies? Where do we look for them? For example, take the issue of markets. In the last financial year, we placed a lot of money in markets, which is a function of county governments, done by the national Government. Another issue is that of grants. Each year, there are grants disbursed to counties. However, at the point where we determine what resources go to which counties, nobody knows the counties that have been getting grants. For example, Embu is listed among the counties that deserve increased allocations. But when you look at grants, you find that Embu has received more in grants than Busia over the past few years. This is an issue that must be revisited. We must ask ourselves: where do we usually allocate our grants? When discussing additional revenues, where do those revenues go? These are factors that should be evaluated consistently when allocating resources. Finally, we are allocating resources to counties where the Equalisation Fund has also placed resources. The Constitution outlines the purpose and target areas for the Equalisation Fund. Why are we again directing resources to those same counties using the same indicators? What this means is that some counties are receiving double allocations. One from the Equalisation Fund and another from horizontal allocations. These allocations are based on identical criteria. These are critical factors that we need to evaluate moving forward. One day, someone will challenge us in court. Why are we not adhering to constitutional The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Bondo, ODM",
          "speaker_role": "Hon. Gideon Ochanda",
          "speaker_url": null,
          "speaker_details": null,
          "content": "parameters that must be looked at keenly? Why are we adding more money to some counties after allocating significant resources through other mechanisms? Why are grants ignored when reviewing county allocations? Why are we applying factors used by another fund for horizontal placement? Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The Hon. Tom Joseph Francis Kajwang’, Member for Ruaraka.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Ruaraka, ODM",
          "speaker_role": "Hon. TJ Kajwang’",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, even though I do not intend to marshal two-thirds of the House to overturn this Bill, I must speak to the negative. I find the formula adopted by the Commission to be fairly simplistic. After 15 years of constitutional implementation, we ought to have reviewed and adopted more robust statistical models for discussions on revenue sharing. When the formula is narrowed down to population, geographic size, and poverty index alone, many other important statistical indicators are excluded. These are indicators which dovetail with production or development in a country. I rise after listening to earlier speakers decry, for instance, why a capital city like Nairobi should be allocated a significant portion of revenue. I wish to defend Nairobi, not because I come from Nairobi City, but because I also live and do business here. Nairobi is the apex. In terms of Gross Domestic Product (GDP) contribution, you develop places where factors of production are easily harnessed and developed to sustain quick and robust changes. That is where we ought to direct our finest infrastructure and resources. The population is fairly industrious, dynamic, and capable of productivity. We must stop thinking in tribal or sub-county terms. We must think nationally. Development of urban centres is not just for the benefit of a region. It is for the benefit of the nation. I would expect development parameters such as development index, life expectancy, reproductive health and access to essential services to be considered. What resources are available in a county? What minerals lie underground? I would have no issue if Taita Taveta, for example, received more money to exploit its mineral wealth. nor would I object to Turkana receiving additional allocations for oil exploration. If we merely distribute money because regions are labelled as counties in the Constitution, just to appease everyone, we fail to create meaningful development and fail to enhance our GDP. We must think as a nation, although there is devolution, which allows us to harness our rural areas. If Migori, for instance, could lead us in terms of GDP growth, let us invest in Migori and use it as a national launchpad towards being like Singapore. We need an intellectual discourse around these formulas. We must think as patriots and move away from thinking of ourselves as small, fragmented entities called counties. The last thing we need to do is allocate funds where money yields more money, and where real happiness results. Sometimes, real happiness is not always about money. Sometimes it is about social protection. Sometimes it is about social justice. Just recently, we saw young people protesting in the streets. That should concern all of us. The indicators of social justice in Nairobi, for example, are alarmingly low. That ought to be a parameter when allocating resources. I admit that this is a complex science. But I urge this House to put its mind to the task. We must develop a more reasonable and widely accepted formula. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Ruaraka, ODM",
          "speaker_role": "Hon. TJ Kajwang’",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I know Daktari knows I do not have two-thirds to override this Motion. I, nonetheless, leave it in the Hansard that somebody will consider that I, T. J. Kajwang’, raised substantive and robust criticisms against the formula used. Thank you very much.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. (Dr) James Nyikal.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Seme, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker, for giving me this opportunity. I rise to support the report and the proposed formula. It is an improvement on the previous one. I also appreciate the effort that has gone into developing it. However, it has limitations. It is based on only three things: population size, land area, and poverty index. Now, looking at the poverty index is looking at the reverse. It would have probably been better to look at the human development index because it tells you what people need. The poverty index tells you how much people are suffering without giving solutions. The human development index tells you the state of health, education, and the standards of living of a people. For example, in health, you would use such figures about life expectancy at birth. With further analysis, you will find out why life expectancy is shorter in this country, for instance, Nyanza compared to the central parts of the country. It will inform how long people have been in school and what they have achieved by the age of 25. Thereafter, we will look at their per capita income. I think those will give you a more robust indicator or index. You can also use practical formulas like distance to health centres. Determining how far people in a given county walk to the nearest health centre and the number of tarmac roads in kilometres per individual. Those are more direct ways of looking at it. It informs how many more tarmac roads we need. The distance to health facilities informs the number of health facilities in an area and how many more are needed. As much as they are using the poverty index, they should work with the human development index and its components next time. That will get the direct input needed to estimate allocation to counties. More important is how money is used. Every time we stand here to talk about corruption in counties. In my opinion, the greatest change since devolution is the number of expensive houses you see in the countryside. When you ask, you find that most of these people work in counties. To which I say, “Well, at least something has happened”. We talk about corruption but there is one thing we do not look at. What about systems? Systems help us reduce corruption. Although we cannot eliminate it, we can reduce corruption. We were talking about the financial systems we use in counties just last week. We have the bigger Public Finance Management Act. However, how well are people at the county level trained on procurement systems? Regarding human resource, I will give an example of the health sector to which I am familiar. Of all devolved functions, I think health is the sector with the largest and most complex human resource. That is why we have the issues. On training, we have only one school of government in the country. By now, and because of devolution, one would expect we have many schools of government in various parts to enable county officers get appropriate training. We compare county governments with the national Government that has existed for over 100 years. The number of people who have gathered experience is huge in national Government. County governments have existed The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Seme, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "for about 10 years. They need a lot more intensive training, however, much we expect them to gather experience. It is also clear that they are figuring out the 12 counties because they are small. The size of counties also matters. I believe that our counties are too small. The evidence is that they are now coming up with regional blocks. They have realised that they need to be larger to be more productive. How did we get to this number 47 in Naivasha? I know it may be difficult to go back to the eight that were originally proposed. These are issues that we must keep looking at. Regarding raising own revenue, we should put an index in the distribution formula that indicates how much a county has raised and thereafter reward those who are doing well. They should probably get more as an incentive. Otherwise, we want to depend on the results of this formula without raising own revenue. I have said before that we had the Constitution Implementation Commission. It was largely legal but it died because its term was over. We later came up with the Transition Authority and now the Intergovernmental Relations Technical Committee (IGRTC). This House also has a Constitutional Implementation Oversight Committee. I think we should regularly look at their structures and performance. What are the underlying factors if Members of County Assemblies are constantly working hard to impeach governors? What are the factors if counties are not performing? Thereafter, we can review the whole county governance with these facts in mind. The formula they are working on is fairly scientific and difficult but it can give a basis for regular review of how devolution is working. With that, I support. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Next is the Member for Kitui Central, Hon. (Dr) Makali Mulu.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kitui Central, WDM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you for this opportunity. I join my colleagues in commenting on this Fourth Generation Revenue Sharing Formula. As I do that and from the word go, I want to say that I would have opposed this formula if I was able to move the numbers. Let us go on record on a number of issues now that we will not be able to move the numbers. Hon. Temporary Speaker, sharing public resources has never been an easy assignment. It actually triggers war and causes serious conflicts in some countries because resources generally determine how areas or regions develop. I have looked at the factors considered in this Fourth Generation Revenue Sharing Formula and the three previous formulas. If you analyse the first to fourth formula, they have dropped some things and onboarded new ones. They have been changing contribution percentages and it has impacted how much each county gets. I must appreciate the current formula for one thing: ensuring that, in future, no county will get less than what they have gotten in the past. That is important. Let me take you back to the history of this country. There was Sessional Paper No.10 of 1965 on African Socialism and its Application to Planning in Kenya . What did that paper do? It emphasised on developing high potential areas in this country; meaning that allocation pushed public resources to areas seen to have high potential. From the word go, resource The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kitui Central, WDM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "allocation was done keenly. As a result of that, some regions were marginalised and we came up with the Equalisation Fund. It is by design that some parts of this country have remained poor for some time. That is the reason the poverty levels are very high. The reason why we have been pushing for poverty index to be this high in terms of percentage is to help these areas to scale up. The percentage that is allocated to poverty levels has kept on reducing every year. We are now going back to push for population to be the leading factor of consideration. Through Sessional Paper No.10 of 1965, these areas were developed and people migrated from the marginalised areas to high potential areas. The population of these areas became very high. Through the fourth-generation formula, it is like we are going back to the Sessional Paper No.10 of 1965 in terms of planning. When you give a certain population 45 per cent of the available resources, it is unfair to the rest of the country. There are areas with huge geographical size where providing goods and services is a tall order. However, we are now downgrading geographical area and upgrading population. With time, counties with a big geographical area will never develop at the same pace with counties that have high population. For example, South-Eastern, North-Eastern and North Rift parts of this country will always be marginalised because we are, again, pushing resources to areas with high population. If I was to have my way, I would have the percentage pegged on population reduced and the percentage pegged on the geographical area increased. Our Constitution states that resources should be shared in a way that counties can implement their functions. As a country, we have not cost devolved functions fully. About 10 years ago is the last time we attempted to cost devolved function. Things have changed. For example, the price of a unit of electricity today is not the same with how it was in 2013. So, we need to ask ourselves how much money in totality do counties require to be effective in the implementation of their functions so that we can cost all functions of counties and propose an amount that they will require to implement them, for example, Ksh700 billion, and how to share it. In the immediate formula, the third generational formula, issues of health, agriculture and roads development were factored and they have now disappeared. In an area like Garissa, there are no roads. They have paths in the name of roads. At what point will we develop roads in Garissa, Mandera, Kitui and Makueni if we do not factor in the level of development in our sharing formulae? It looks like we are still pushing so hard for resources to be where people are and we will continue being left behind. On corruption, we all talk about it here. How will we address corruption when we exclude fiscal responsibility as a factor in sharing resources? We do not care how people use resources before we give them more resources. We should have a situation where fiscal responsibility becomes an important factor in sharing of resources so that those who take care of public resources are given more resources and those who misdirect resources are given less resources. We will have more people joining the league of those who use public resources well. For now, it does not matter whether one uses public resources well or not. They will still get public resources based on this formula. How I wish we had a way of bringing up such a formula to address the situation. Since we cannot raise the two-thirds majority to change this formula, we will live with it for the next five years. Those who are marginalised will continue being marginalised and those who are developed will continue developing. I submit.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Yussuf Mohamed. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir West, ODM",
          "speaker_role": "Hon. Yussuf Farah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker for giving me this opportunity to add my voice to the Motion on the Fourth Generation Revenue Sharing Formula. As my colleagues have said, if today we could achieve the two-thirds majority to reject this Motion, we could have done it. Unfortunately, we cannot do it. We are forced to support the Motion. For the record, I want to make my reservations. The Constitution has outlined policies and guidelines on how resources are shared between the two levels of government. However, despite the well formulated guidelines on revenue sharing formula, there has been a delay in agreeing on the amount to be allocated to the two levels of government because of certain interests. The factors used to determine revenue sharing are quite alarming. When one of the factors to be considered for revenue allocation to county governments is population index based on the 2019 Kenya population census, that clearly shows you how we do not care about certain parts of this country. We all know that the 2019 population census was cooked in the Ministry of Interior office by some crooks who pretended to be the officers conducting the census. Some areas have been deliberately marginalised and their population numbers tampered with and reduced by three quarters. The same parameter has been used to allocate resources to counties that have been marginalised for decades. The 2019 census results are in the corridors of justice. The Arid and Semi-Arid Lands (ASALs) counties went to court to challenge the decision of the Kenya National Bureau of Statistics on Kenya population and housing census. That census was set aside. Using that nullified census results as a parameter to allocate resources to certain counties is not acceptable. That will return this country to Sessional Paper No.10 of 1965 that was a deliberate attempt to marginalise specific areas and deny them their rightful resources in this country. The other issue is using geographical size as a determining factor and putting it at 10 per cent. What are we using …",
          "procedural_notes": []
        },
        {
          "speaker_name": "Baringo, UDA",
          "speaker_role": "Hon. Jematiah Sergon",
          "speaker_url": null,
          "speaker_details": null,
          "content": "On a point of order, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "What is your point of order, Hon. Jematiah?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Baringo County, UDA",
          "speaker_role": "Hon. Jematiah Sergon",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, I rise under Standing Order 95. I agree with the Members who have spoken on the Floor that this is a good debate. Considering that we are debating on the revenue sharing formula, and for us to conclude and vote, we need a substantial number in the House which we do not have, I request you, Hon. Temporary Speaker to call the Mover to reply. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Jematiah, I will seek the decision of the House on the matter that you have raised once the Member speaking concludes.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir West, ODM",
          "speaker_role": "Hon. Yussuf Farah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Correct! Thank you, Hon. Temporary Speaker, for protecting me from Hon. Jematiah, who cut me short. I was speaking to the issue of geographical size being used as a factor to determine revenue sharing. However, capping it at 10 per cent is unacceptable. What are we going to use this money for? The first question we need to ask is, why are we devolving resources by allocating them to the counties? We are devolving resources to develop every village in this The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir West, ODM",
          "speaker_role": "Hon. Yussuf Farah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "country. For a village to have a tarmac road, it needs resources. If you do not consider the length of the road or the distance covered to get to available hospitals at the village level, what are you going to use this money for? I thought geographical size would have been the first factor to use to determine the sharing of resources so that those areas that are yet to be developed are developed. Some parts which this Bill favours, are already devolved since Independence. They have tarmac roads, tap water and hospitals. On the contrary, those areas that have been marginalised for quite a while and their geographical size is much bigger, which I believe do not have even a kilometre of tarmac road, have still, been marginalised in this revenue sharing Bill. With all those reservations, the amount allocated is way better than the previous years. Some people are still talking about corruption, yet it is everywhere. As Members of Parliament, we must stand against corruption in this country. It is upon us and the rest of Kenyans to stop it. We will not allow hard-earned money to go to waste. The national Government is getting 85 per cent of this revenue, while the marginalised areas are not even getting one per cent of it’s share. How do we make the marginalised counties that have a bigger geographical area and a population which was manipulated to be at par with the rest of the counties? With those few remarks, I thank you Hon. Temporary Speaker for giving me this opportunity.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. Hon. Members, Hon. Jematiah stood in her place and asked for the decision of the House on whether the Mover should be called up on to reply.",
          "procedural_notes": [
            "(Question, that the Mover be now called upon to reply, put and agreed to)"
          ]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Mover.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I would like to thank the Members for debating this Bill in the manner that they have, more particularly, offering very strong criticism of the Bill. The Report that I have just tabled….",
          "procedural_notes": [
            "(Hon. Gathoni Wamuchomba stood along the gangways)"
          ]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Is that Hon. Gathoni Wamuchomba? Asumbi Girls is in the House. I want you to sit before they are recognised. Please be orderly. Hon. Atandi, continue.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, some of the issues that Members have raised include the failure by this Report to include fiscal discipline as a parameter for consideration of revenue sharing among the counties. I agree with those Members who are saying that this is a very important parameter that should have been used. However, the argument that was advanced by the Senate when they appeared before us to defend this Report is that some governors are not financially disciplined. Therefore, the The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Alego Usonga, ODM",
          "speaker_role": "Hon. Samuel Atandi",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Senate felt that denying the people resources on the account of poor fiscal management by a governor was not prudent. This formula allowed this parameter not to be considered; that if one governor is not financially disciplined a county is denied resources. The other factor that has been raised is why only 12 counties were identified for use in the new formula. These counties are small, and that is why affirmative action has been employed for them. Previously, using the two important parameters, population and geographical size, these counties received very little resources and at the end, they have no resources to undertake development programmes. That is why they were identified for affirmative action in the new formula so that they receive extra money to allow them to undertake development programmes. With those many remarks, I would like to reply. Hon. Members, I want to put the Question, but before I do, let me once again notify you that we do not have the numbers required for you to negative this Motion. Either way your voices go, the Ayes will have it.",
          "procedural_notes": ["(Question put and agreed to)"]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Before we proceed to the next Order, let me recognise the following institutions visiting the National Assembly today. In the House, we have the Good Shepherd Academy from Mwala Constituency, Machakos County and Asumbi Girls High School from Rangwe Constituency, Homa Bay County. Hon. Members, Homa Bay County is my County, and my mother attended Asumbi Girls High School. She was a pioneer student when the school started as a primary school. On behalf of the National Assembly, I welcome these two schools to this House of Parliament for their study tour. Now, I will allow the Whip of the Minority Party, Hon. Millie Odhiambo- Mabona, the good girl - not bad girl today - to welcome both schools.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie Odhiambo-Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker for giving me this opportunity. I am always a bad girl because good girls do not get the corner office, and the girls must know that for them to make it in life, they have to be bad girls. But they have to be bad girls in a good way: a bad girl who speaks out when things are going wrong, and who says no to people who force you to do wrong things. I am happy to welcome the two schools, one from Machakos County and the other from Homa Bay County. My two sisters went to Asumbi Girls, so I am very connected to the school. My sister, who works in California was also a student there and even taught at the school. Asumbi Girls High School is one of our best schools. The girls are doing well, and they are happy to have women whom they can emulate. In Homa Bay County, the Governor, Hon. Gladys Wanga is a woman.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kisumu West, ODM",
          "speaker_role": "Hon. Rozaah Buyu",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Did she go to Asumbi Girls?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie Odhiambo-Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "No, she did not go to Asumbi Girls High School, but she is the Governor and a woman. Their Member of Parliament has been waiting for the girls since morning and has requested me to welcome them. She had to run because she had a problem with her voice, but she is on her way. Hon. (Dr) Lillian Gogo is also a woman. Yours truly, bad girl Millie Odhiambo is also a woman. The woman The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie Odhiambo-Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "representative, Hon. (Dr) Bensuda, and Hon. (Dr) Eve Obara are also women. The men in our county will have problems because I am currently doing my Doctor of Philosophy (PhD). We will only be hearing of “Hon. Peter Kaluma and Hon. Martin Owino,” but the rest of us will be referred to as Hon. (Dr) Millie Odhiambo, Hon. (Dr) Eve Obara, and Hon. (Dr) Lillian Gogo.",
          "procedural_notes": [
            "(Laughter)",
            "(Hon. (Dr) Lillian Gogo walked into the Chamber)"
          ]
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie Odhiambo-Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Here she is. We are happy to see the girls. How far you go is up to you; it is not dependent on your circumstances because you can always overcome. Welcome to the National Assembly. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I will be in trouble because I do not have a doctorate yet I come from Homa Bay County. Now that Hon. (Dr) Lillian Gogo is here, I will give her an opportunity to welcome our students from the best school in the country.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kisumu West, ODM",
          "speaker_role": "Hon. Rozaah Buyu",
          "speaker_url": null,
          "speaker_details": null,
          "content": "On a point of order, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Do you have a doctorate?",
          "procedural_notes": ["(Hon. Rozaah Buyu spoke off the record)"]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "You are not recognised. Proceed, Hon. (Dr) Lillian Gogo. This time is only for women with doctorates.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I acknowledge that you are a great grandson of Asumbi Girls High School represented here today. Hon. Jalang’o has also asked me to mention that he is associated with the school by dint of coming from Homa Bay County. I celebrate all the students visiting the National Assembly. Specifically, allow me to celebrate Asumbi Girls High School for their exemplary performance in the national exams and extracurricular activities.",
          "procedural_notes": ["(Loud consultations)"]
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. (Dr) Lillian Gogo will be heard in silence.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker for the protection.",
          "procedural_notes": ["(Hon. Kimani Ichung’wah consulted loudly)"]
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The Leader of the Majority Party, Hon. Kimani Ichung’wah, does not have a PhD. Please take a seat. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Asumbi Girls High School takes care of smart girls who are called to other national schools but are unable to cater for their fare to various schools across the country. When I approached the Principal, Ms Linet Pino Sati, all our brilliant girls were absorbed in the school. May God bless you, Ms Linet, and bless Asumbi Girls High School. I welcome the girls to the National Assembly. I know we have many leaders among them. Other than being in the echelon of political leadership, I know they will become leaders in business, medicine, engineering and law. Thank you, Hon. Temporary Speaker for the opportunity.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Githunguri, UDA",
          "speaker_role": "Hon. Gathoni Wamuchomba",
          "speaker_url": null,
          "speaker_details": null,
          "content": "On a point of order, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "What is out of order, Hon. Gathoni Wamuchomba?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Githunguri, UDA",
          "speaker_role": "Hon. Gathoni Wamuchomba",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I raised my hand when my sister and very good colleague, Hon. (Dr) Lilian Gogo, was submitting. She alluded to the fact that Hon. Jalang’o is associated with Asumbi Girls High School. I needed clarification. Is Hon. Jalang’o an alumnus of Asumbi Girls High School?",
          "procedural_notes": ["(Laughter)"]
        },
        {
          "speaker_name": "Githunguri, UDA",
          "speaker_role": "Hon. Gathoni Wamuchomba",
          "speaker_url": null,
          "speaker_details": null,
          "content": "We need a clarification because we are worried. If he is an alumnus, things might change this afternoon.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. (Dr) Lillian Gogo, what is the relationship between Hon. Jalang'o and Asumbi Girls High School, our best girls’ school?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I want to thank my sister, Hon. (Dr) Gathoni Wamuchomba. She just wanted me to acknowledge that she also has a PhD because the Floor this afternoon is for Members with PhDs. She has literally transformed into orange. Welcome to the party of the people. I want to explain how Hon. Jalang'o is related to Asumbi Girls High School. I used very simple English and said that he is related to Asumbi Girls High School by dint of coming from Homa Bay County. That is the English that Hon. Wamuchomba did not get.",
          "procedural_notes": ["(Laughter)"]
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Jalang'o comes from Homa Bay County where Asumbi Girls High School is located. It is only 20 kilometres from Homa Bay Town. Thank you, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "At the risk of diluting the doctorate degrees before we transact the next Business, just on a special request, I will give an opportunity to Hon. Irene Mayaka to welcome all the students for a minute.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "First of all, there is nothing you are diluting. I am just doing my second degree in law. I have the advantage of age and therefore, I will get a PhD like the rest. I want to specially welcome the students in the Chamber, especially Asumbi Girls High School. My niece, Ms Amara Aluodo, is part of the team. I have known her since she was seven days old. I know she also wants to be a Member of Parliament. I wish her and all the others the very best. She is now in Form Four and is about to sit her exams. All the best to all of them. We appreciate you, girls. Do not worry. You will get there. The doctorates are coming.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Members, if we allow the House to debate about Asumbi Girls High School and the other schools, we will be here up to tomorrow because we are all connected to Asumbi Girls High School. I want us to transact Business.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Please give Hon. Jalas a chance.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Does he have a PhD?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Rangwe, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Does Hon. Jalang'o have a PhD? He can then contribute just for a minute.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Langata, ODM",
          "speaker_role": "Hon. Phelix Odiwuor",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you very much, Hon. Temporary Speaker for giving me this opportunity to welcome all the students and especially, Asumbi Girls High School, which is from the county where I was born and bred.",
          "procedural_notes": ["(Applause)"]
        },
        {
          "speaker_name": "Langata, ODM",
          "speaker_role": "Hon. Phelix Odiwuor",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I went to Lake Primary School. Many girls from that school joined the honourable Asumbi Girls High School. It was the dream school for many girls in the county. They have continued to excel in their exams and show the same spirit that we had in those days. We hope that they will continue in the same manner. I want to tell them that it does not matter where you come from. You know how Homa Bay County was back then. Hon. Millie can tell you. We grew up in Homa Bay County together. It was prestigious for a girl to go to Asumbi Girls High School. It is still prestigious, and it will always be. Welcome my girls from Asumbi Girls High School. Karibuni sana to the National Assembly. Asante .",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "All the visiting schools and students are welcome to the House during their learning tour. Call the next Order.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "BILL",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, before I move the Bill for Second Reading, I want to take a minute to welcome these great girls to the National Assembly and to also inform them that the great Nakuru County is also bestowed and gifted with many elected women leaders. We have Hon. Martha Wangari, the Member for Gilgil; Hon. Jayne Kihara, the Member for Naivasha; Hon. Irene Mrembo, the Member for Bahati; Hon. Charity Kathambi, the Member for Njoro; our Governor, Susan Kihika; and our Senator, Tabitha Keroche. They call us the county of girls. That shows you that women have power and they can fight alongside men and win seats. You should emulate the great ladies of Homa Bay and Nakuru counties. I am confident that you will become great leaders in the Republic of Kenya. I also want to caution our brothers and sisters from Central Kenya. Whenever there is a grammar issue, we need to be very careful not to pick a fight with our brothers and sisters from the Lakeside because we will lose that fight for sure as Hon. Wamuchomba has witnessed on the Floor of the House this afternoon. Hon. Temporary Speaker, I beg to move that The Virtual Asset Providers Bill (National Assembly Bill No.15 of 2025) be now read a Second Time. This Bill was published on 17th March 2025 and referred to the Departmental Committee on Finance and National Planning for consideration. Before I get to the nitty- gritty, I want to share with you a few quotes from businesspeople across the world. The Chief Executive Officer (CEO) of BlackRock reminds us that virtual assets are reshaping the entire financial landscape. There are huge opportunities for interactions. One of the most respected names in this space is David Solomon who says that cryptocurrencies have defined what it means to store and transfer value. Kenya is ranked third in Africa in on-chain weighted transactions volume. In the last one year, Kenya traded US$2 billion in decentralised protocols, liquidity aggression and synthetic platforms. We have approximately 6.1 million users who use Electric Vehicle (EV) capabilities, Chain-key Tokens, Crypto bridges, Wrapped Bitcoin (WBTC), gas subtracted Stablecoins and Zero-Knowledge (Zk) Rollups deployment. We have potential in this space to generate at least US$1 billion in terms of foreign direct investment. The passage of this Bill has the potential to create, at least, 25,000 jobs in Kenya in the next one year. We look forward to the new Blockchain technology and tokenisation being used to solve the challenge of budgetary allocation in our country. The Controller of Budget estimates that we have approximately Ksh550 billion worth of pending bills. I look forward to when this can be tokenised so that we can have people across Kenya and around the globe contributing to this space without constraining the Exchequer to be given the limited fiscal space we have in our budget. What are we doing as a nation to embrace this novel innovation in finance that the world is already embracing? At the very least, if this House considers and passes this Bill, Kenya will be the fourth country in Africa to do so by maintaining a progressive spirit of building Kenya to be the Silicon Savannah. Virtual assets are digital representation of value that are created, usually by mining. They are traded or transferred in the digital sphere often using Blockchain or other Distributed Ledger Technologies (DLT). They have many uses. They can be used as a medium of exchange, a unit of account, a store of value, or even for investment purposes, The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "with specific digital ecosystems under cross-border financial systems, depending on their structure and application. The question begs: should we regulate these assets? Kenya has witnessed a remarkable rise in cryptocurrency adoption, with over 10 million citizens now holding one form of digital asset or another. There is significant engagement in peer-to-peer cryptocurrency trading, which has earned Kenya a top position in global rankings for trading volume and overall cryptocurrency activity, according to the China Analysis Global Crypto Adoption Index of 2023. This growth demonstrates substantial interest in digital assets, especially among young Kenyans, and highlights the sector’s economic potential. Over the years, our traditional financial regulators, particularly the Central Bank of Kenya (CBK) and the Capital Markets Authority (CMA), have adopted a cautious approach towards virtual assets. For instance, in 2015 and 2022, the CBK issued cautionary notices to financial institutions, warning against engaging with cryptocurrencies and stating that they are not recognised as legal tender. However, we now realise that burying our heads in the sand is no longer tenable. In this regard, the National Treasury has brought forward the Bill before us, sponsored by the Leader of the Majority Party. When I was elected to this honourable House during my first Term in 2017, I raised a question in 2018 to the then Governor of the Central Bank of Kenya. I asked what measures the CBK and the National Treasury were taking to prepare for the emergence of bitcoin, blockchain technology, and cryptocurrency. The Governor responded that cryptocurrency and blockchain technology were a passing cloud, a fad that would fade away. Today, it is evident that these technologies are no longer a fad. Digital assets, including bitcoin, blockchain, Ethereum, stablecoins and others, are here to stay. The scope of this Bill is designed to regulate all individuals and entities engaging in virtual asset services within or from Kenya. It applies to companies incorporated under Kenyan law, or foreign companies recognised under the Companies Act, and licensed to provide virtual assets as defined in the First Schedule of the Bill. However, the Bill deliberately, excludes certain types of digital representations to avoid over-regulation. Exempted items excluded by the relevant authority include digital representations of value or rights that operates within a closed ecosystem such as in-game currencies that cannot be exchanged for fiat money or traded outside the issuer’s platform, central bank-issued digital currencies, certain non-fungible tokens not used for payment or investment purposes, and others. The Bill carefully, defines its scope to ensure that only virtual asset activities posing financial, consumer or systematic risks fall under regulatory oversight. At the same time, it seeks to preserve innovation and minimise unnecessary regulatory burdens. This approach is particularly important, considering past cases in Kenya where the lack of regulation led to consumer losses. For example, in 2023, thousands of Kenyans lost millions of shillings when the cryptocurrency platform Bitstream Circle collapsed. It had promised high returns and operated without any regulatory oversight, yet it was not licensed or monitored by any Kenyan authority. Such cases highlight the dangers of unregulated virtual assets services and demonstrates the need for a clear legal framework to safeguard public funds. Any person or entity seeking to provide virtual asset services must now apply for a licence from the relevant authority, which could be the Capital Markets Authority, the The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Central Bank of Kenya, or the proposed new body, the Virtual Assets Regulatory Authority. The Bill places strong emphasis on the prevention and management of conflicts of interest among licensed Virtual Asset Service Providers (VASPs). These providers must establish and maintain effective internal policies to identify, mitigate and manage potential or actual conflicts of interest. For instance, if a VASP acts as both a broker and a client, it must separate those roles clearly. Where such conflicts cannot be avoided, they must be reported to the relevant authority.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The Bill outlines enforcement measures for any contraventions of its provisions, including clearly defined fines set out in the schedule. It also provides an appeals mechanism. If a licence application is rejected, the Bill sets timelines for the regulator to respond, outlining the documents required and the reasons for approval or denial. This is intended to prevent the delays seen in other sectors, where regulators have taken years to issue licences even after laws have been passed. Additionally, the Bill allows the Cabinet Secretary to issue further regulations. Since this is a new entity, not everything can be captured in the principal law. The Cabinet Secretary will be required to issue such regulations within six months of the law coming into effect.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "One of the key advantages of blockchain technology is its decentralised nature. Unlike traditional financial systems, which rely on central authorities, blockchain operates on a distributed ledger maintained by a network of nodes. This decentralisation reduces single points of failure and enhances the security and resilience of financial systems. For instance, Kraken, a global leader, has partnered with DeFi Development Corp to tokenise shares on the Solana Blockchain. This demonstrates the potential of decentralised finance to integrate traditional assets into blockchain ecosystems. I hope this Bill will help make this reality in Kenya. Another critical feature of blockchain is transparency. Every transaction is recorded on a public ledger that can be audited by anyone. This helps build trust among users and reduces fraud and corruption. Platforms such as Coinbase can tokenise Government securities and provide real-time visibility into their ownership and transfers, thereby improving accountability. One day, I hope we can use this technology to safeguard public assets. Issues such as the duplication of title deeds could be addressed through blockchain, where any attempt to change a title deed would be easily detected. Blockchain records are immutable; once a transaction is recorded, it cannot be altered or deleted. This feature is essential for maintaining the integrity of financial records and prevents tampering. We should consider amending our land registration and procurement systems to incorporate blockchain technology so as to reduce fraud and enhance transparency.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "This legislation seeks to democratise access to investment opportunities through tokenised investment tools. By breaking down assets into smaller, more affordable units, tokenisation allows a broader range of investors to participate in markets that were previously inaccessible. For example, for you to own a parcel of land in Kenya, you need to own the entire piece of land. It will, therefore, be possible for Kenyans across the economy to own part of that property and gain profit from that interest for now. For you to buy a piece of land, you probably need to buy a 50 by 100,100 by 100, one acre, one hectare or whatever it is, but by using tokenisation, it is possible to have this land accessible to young people in this country through those small units and have them get a considerable return on investment. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The efficiency of this blockchain is another compelling advantage that as a country, we should tap into. Traditional financial transactions often involve multiple intermediaries, leading to delays and increased costs. It will be important to remind ourselves how, for example, the Blockchain Technology and in particular, the Bitcoin, was launched. During the financial system breakdown in the United States of America, we had banks in the midst of competition to issue mortgages to almost every American. Consequently, what happened? The price of those houses, considering the force of demand and supply, fell lower than the mortgage amount that was mortgaged in particular institutions. Therefore, this led to the collapse of the entire financial system in the United States of America. This is what these young people who are accountants, financial analysts and computer scientists wonder. How can we preserve value for assets without necessarily having to use intermediaries? This technology that we are talking about - the digital asset - is now providing that space where you no longer need an intermediary to store value for your asset consequently, reducing the fraud that occurs in that space. This technology will support development of what we call smart contracts, which are self-executing contracts with the terms of the agreement directly written into a code. Smart contracts can automate various financial processes and reduce the need for manual intervention and minimise the risk of human error. As we style ourselves as a Silicon Valley, we need to enable this framework and this is our opportunity. One of the issues that we see in matters of litigation across the country, is in terms of contracts that have not been honoured. Using this technology, we can have smart contracts that get to mature and whatever is supposed to be executed, is executed through technology without having to have any human intervention. Therefore, this will even reduce the litigation that goes in our court systems for unhonoured contract. I do not want to belabour the point anymore but let me underscore that the potential for innovation in Blockchain Technology is vast and will create immense opportunities for our economy, including creation of jobs. As technology continues to evolve, new applications and use cases are emerging. For example, the integration of Blockchain with other technologies such as Artificial Intelligence (AI) and Internet of Things (IoT) are creating new opportunities for financial innovation, and as a nation we should not be left behind. This framework landscape for Blockchain and virtual assets is evolving. Governments and regulatory bodies are increasingly recognising the potential use of these technologies. In Africa, as I said, we will be the fourth nation to pass this law and I call upon this House to support the Bill and the amendments that this Committee is going to bring to the House. Hon. Temporary Speaker, Jamie Dimon, a Chief Executive Officer, said that the Blockchain is the financial challenge of our time. It is going to change the way our financial world operates. A few years ago, a few people sat and discussed the creation of M-Pesa. At the time, Vodafone said that it was impossible: “Everyone uses banks, relies on the banking system, and we cannot have money being transferred through mobile phones.” A few people in that room, the likes of Michael Joseph and others who improved on that technology said, “No, it is possible.” A few young Kenyans were tasked to create that platform and now, much more money is exchanged on M-Pesa than any other financial system in Kenya. Blockchain Technology, virtual assets, is the new M-Pesa. A lot of transactions globally are now not happening through the traditional banking systems, and they are not happening through The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "mobile exchanges; they are happening through virtual assets. I hope and pray that this honourable House will make Kenya lead so that we attract Foreign Direct Investment (FDI) for institutions to come up and set up in Kenya and expand to the rest of Africa, making Kenya the Silicon Valley of virtual assets. Let us not be scared of new technologies. Let us also not be afraid of these new technologies. Let us embrace them, let us promote them, let us support them, and make sure that we are not left behind by the rest of the world. With those many remarks, I beg to move and request my senior, the Leader of the Majority Party, and the great Member for the great people of Kikuyu Constituency, to second. Thank you, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Peter Kaluma",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Leader of the Majority Party.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I rise to second this Virtual Asset Service Providers Bill that has been ably moved by the Chairperson of the Departmental Committee on Finance and National Planning that considered this Bill. Hon. Temporary Speaker, as he has said, Kenya is indeed a beacon of innovation and growth in Africa in the sector of financial services. Indeed, as the Chairperson alluded, M- PESA is such one example of financial inclusion services in the financial services sector, where Kenya has not just become a beacon of innovation, but also become a focus point for the entire world. Even before America, the Silicon Valley, and India, and other countries moved into mobile money transfers, Kenya led the way. Therefore, we cannot afford to be left behind in the space of virtual asset. It is important that we have a legal framework that will form the basis of the regulatory work of the virtual assets themselves, the regulation of virtual assets systems, and also the service providers of virtual assets. Hon. Temporary Speaker, Kenya has witnessed increased adoption and use of virtual assets, particularly in payments and investments over the years and these assets present very good opportunities to promote digital finance, boost commerce, especially e-commerce, and even create a new class of digital jobs. Our young, innovative men and women in our universities and those graduating from our mid-level technical and technology colleges have an opportunity to explore the digital jobs that come with these virtual assets. Unfortunately, the benefits of these virtual assets have also been challenged by cyber security risks, data privacy risks, fraud, and scams in the country. The best case example is the World Coin episode about one or two years ago. I remember the hullaballoo that was there at the Kenyatta International Convention Centre (KICC) with World Coin and Bitcoin but those are the challenges that come with these virtual assets. There are also questions that touch on not just cyber security, but also data privacy, and you remember the challenges then with World Coin was on data privacy. The challenges that were there was where the data collected was being taken to, which included the scanning of people's eyes and a lot of private data. We have a lot of challenges with data privacy, cyber security risks, fraud, and what are outright scam where many Kenyans have been scammed in the pretext of buying Bitcoins; some that are just Ponzi games that are sponsored by innovative people in the fraud industry, because fraud is also a very huge industry. Many of those people, including some who are in our space, are involved in what has been christened The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "the wash wash . The wash wash industry, you know, was a very big industry and has been a big industry and these people are now graduating from their wash wash business into the virtual assets industry, and scamming very many Kenyans, especially those who are after a quick shilling or a quick buck. It is, therefore, important that we have a legal and regulatory framework that relates to the use of virtual assets and related activities in the country so that we stem this fraud, the challenges on data privacy, fraud and cyber security risks. Hon. Temporary Speaker, in December 2015, the Central Bank of Kenya issued a public notice, cautioning the public against virtual currencies such as Bitcoin, citing the risks in operating in an un-regulated environment. The notice highlighted concerns around the lack of legal protections, potential misuse of money laundering and terrorism financing and the speculative nature of these assets due to their lack of any underlying value. Consequently, the CBK, through Banking Circular No.14 of 2015, prohibited all financial institutions from engaging in or facilitating virtual currency transactions. The lack of a regulatory and legal framework are challenges we have lived with that it took CBK, through a circular, to caution financial institutions from engaging in virtual assets. But the truth is, we cannot function in isolation from the rest of the world. Virtual assets are a reality. As the Chairman of the Committee said while moving the Bill, if M-Pesa was an innovation some years back, then virtual assets are innovations that we must live with. We should create a legal and regulatory framework to govern how financial institutions in our country deal with and transact in virtual assets. This is because virtual assets have no underlying value. It is not like a piece of land or a car for which a valuer can tell you their value. Speculative habits can quickly move the value of a virtual asset from a dollar to thousands of dollars with nothing underlying. Therefore, if there is no legal and regulatory framework on how financial institutions deal with these issues, then we will leave Kenyans exposed. That is why it has become imperative that we have a regulatory and legal framework as a country. It is against this backdrop that the National Treasury in January, 2025 published the National Policy on Virtual Assets and Virtual Asset Service Providers. The policy lays out a national vision for a secure, inclusive and innovative digital asset economy. It calls for a coordinated regulatory framework led by CBK, the CMA and the Competition Authority of Kenya (CAK). It is also grounded in a public-private collaboration, bearing in mind that many virtual assets are not traded by Government or their trade regulated by Government. It calls for a multi-pronged approach involving CMA, the Communications Authority of Kenya (CA) and CAK and to have a legal and regulatory framework to anchor the policy into law. That is what this Bill seeks to do. It seeks to implement the policy to bring clarity to operators, protect consumers and ensure credibility in Kenya’s digital finance ecosystem to stem the abuse that has been there. I do not want to go into all the details of the Bill, because the Chairman has clearly elaborated what is provided in it. Allow me to draw Members’ attention to Part II of the Bill, which designates CMA, CBK and any other public body approved by the Cabinet Secretary to license virtual assets service providers and regulate, supervise and monitor the promoters of virtual assets. The part also provides for a system of mandatory licensing of persons and businesses. This will ensure that we stem the culture that has been there. I have seen young people who have just finished college purporting to trade in virtual assets, but nobody The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "regulates them. They also do online marketing of virtual assets. They are very tech-savvy and can rope in very many people within a short period and collect a lot of money, then within a short time the whole thing collapses and innocent Kenyans lose their money. Kenyans have been accusing the Government and asking what it has been doing. The Government wants to make sure that there is a legal framework to license traders in virtual assets. For instance, those trading in forex are under the regulation of CBK. Those dealing with equities will fall under CMA or whichever relevant regulatory body. To protect consumers, Part IV of the Bill requires that virtual asset service providers must maintain adequate safeguards for client assets and obtain appropriate insurance cover. This will ensure that in the event of fraud or operational failure, consumers can receive compensation. Additionally, virtual asset service providers must maintain a bank account in Kenya to enable effective monitoring and oversight. As I said earlier, many of the challenges Kenyans have encountered are because of the lack of a regulatory framework. It is not clear how to get your money back from a virtual asset trader if you need to. Before this policy was enacted, there was no framework. The Bill will ensure there are adequate safeguards like in the insurance industry that has the Premium Holders’ Compensation Fund. In case an insurance company collapses, there is a fall-back plan. Banks in this country have either an insurance bond or a cash guarantee in another financial institution to secure people’s deposits. But virtual assets trading has operated in a space where nobody can guarantee you. People have been sending money to bank accounts outside this country but there is no guarantee that they are protected. By maintaining a local bank account, it will become easy for CBK to monitor what is going on and protect investors in virtual assets.",
          "procedural_notes": [
            "[The Temporary Speaker (Hon. Peter Kaluma) left the Chair]",
            "[The Temporary Speaker (Hon. Farah Maalim) took the Chair]"
          ]
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Finally, Part V of the Bill speaks to regulatory authorities being empowered to vet shareholders and senior officers of virtual assets service providers. Regulatory authorities will also be empowered to conduct on-site and off-site inspections and enforce anti-money laundering and financing of terrorism laws. This is because, as I said, every Tom, Dick and Harry walks into Kenya, opens an office at a street corner, collects money from people and disappears. Nobody vets shareholders or owners of virtual assets service providers. It will now be a requirement for licensing regulatory authorities to vet virtual assets service providers to know shareholders and senior officers. They will also conduct on-site and off- site inspections to stem terrorism financing and money laundering. Like all other financial assets, this is one area that could largely be abused by those who finance terrorism or engage in money laundering. Can I say I second?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes. Give him the microphone.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, I was saying we should ensure that anybody involved in the trade is not involved in terrorism financing or money laundering. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kikuyu, UDA",
          "speaker_role": "Hon. Kimani Ichung’wah",
          "speaker_url": null,
          "speaker_details": null,
          "content": "With that, Hon. Temporary Speaker, I beg to second.",
          "procedural_notes": ["(Question proposed)"]
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Naisula.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Samburu West, KANU",
          "speaker_role": "Hon. Naisula Lesuuda",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you very much, Hon. Temporary Speaker, for this opportunity to contribute to this very important Bill by the Leader of the Majority Party, Hon. Kimani Ichung’wah, and moved by the able Chairman of the Departmental Committee on Finance, Hon. Kuria Kimani. As has been said by both the mover and the seconder, this is a very important Bill which seeks to protect consumers of virtual asset services. We are moving speedily in technology. Personally, I have been approached by very many young people, telling me to get into the cryptocurrency space. You do not have to meet them; they tell you virtually where to put money. I can imagine very many people have lost their money because we do not have proper regulations or laws that safeguard consumers. This Bill mandates that any entity offering virtual assets services in Kenya must be licensed by the relevant regulatory authority. Right now, people are just operating in an unaccountable manner. This Bill will ensure transparency and accountability in the industry. Designated regulatory bodies will be CBK, CMA and CA. They will license, supervise and enforce compliance with the law. In terms of compliance and doing what is right, we are the fourth country in Africa to develop a Bill to govern this space. Kenya is never left behind in putting in place necessary regulations. This Bill will also help us to deal with money laundering, terrorism financing and threats to financial stability. It also seeks to protect the consumer of virtual assets such as cryptocurrencies and crypto assets. This is the space many young people are getting into. You will rarely find a young person telling you they want to invest in a piece of land. They are not like the older generation who chase a piece of land or an apartment and wait for it to appreciate and later dispose. So, it is important for us legislators to put laws and regulations in place to safeguard those who are keen on these spaces. Those who will provide these services will need to maintain a registered office to operate legally in Kenya. As I mentioned, we are being approached by people in the streets, telling us to buy crypto. They will now be required to be registered and get a licence to establish and maintain a registered office within Kenya to ensure physical presence for regulatory and customer engagement purposes. In case you con somebody, it will be possible for the regulatory bodies to track you down. Each virtual assets service provider must appoint a CEO who meets the eligibility criteria set by the relevant regulatory authority, ensuring competent leadership. This will also ensure that we are not just dealing with people who do not have the know-how in these matters but someone qualified. The regulatory bodies will ensure that happens. There are some provisions that can be looked at later during the Committee of the whole House. We will see if amendments can be made. The licence and compliance costs are high. Young people who are keen on this will say they are being locked out of practice. The Bill requires all virtual assets service providers to undergo extensive licencing procedures, which may be costly and time consuming. Of course, it is good to have strict and stringent The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Samburu West, KANU",
          "speaker_role": "Hon. Naisula Lesuuda",
          "speaker_url": null,
          "speaker_details": null,
          "content": "measures, but this might lock out small start-ups and young people in this space. I do not think that is the whole essence of the Bill. Small start-ups may struggle with the financial and bureaucratic burdens, leading to monopolisation by large firms. We might want to look at that provision. There is also the whole issue of collection of extensive customer data, which may violate user privacy rights. These are some of the provisions we might want to look out for as we continue considering the Bill. As I conclude, this Bill is very important because it will ensure that people interested in the virtual assets space are safeguarded. I support.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The Member for Kesses.",
          "procedural_notes": ["(Hon. (Dr) Robert Pukose spoke off the record)"]
        },
        {
          "speaker_name": "Kesses, UDA",
          "speaker_role": "Hon. Julius Rutto",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you very much, Hon. Temporary Speaker, for recognising me. I want to remind my good brother and senior from Endebess, Hon. Pukose, that being a member of the Committee I am happy to get an opportunity to weigh in on the information that we derived from stakeholders. It is true to say the market is dynamic. I appreciate this country for recognising that there are some things you cannot change. We say change is constant. One of the changes we cannot avoid is the aspect that the market is ever changing. The whole world is shifting. It came from steel money to stable coins to paper money to card money and now we are using digital money through M-Pesa and other platforms. As we speak, the market has shifted further to virtual assets where you store your value in an asset that is not visible. Something that astonished us when we engaged with stakeholders is that we learned a lot that this market has been existing for some time and the value transacted goes into trillions of US dollars. This is something that we cannot avoid. Something to note on the Floor of the House is that there are countries like the United Arab Emirates (UAE) and many others that have accepted this as a medium of exchange, where you transact virtually and derive value by obtaining commodities in the market for your consumption. Therefore, this brought about the need for Kenya to adopt it in an unofficial manner. It is in use because many Kenyans and business people are in it and many great people who have been investing in other aspects of investments have even spread their risk portfolio to virtual assets. We, therefore, need to organise this market because the risk that comes with it is that there is no place or point where you can reference. There is also no physical office or structure to go to whenever you have an issue to inquire, obtain information, or even petition your complaints whenever you have a case arising out of it. This Bill will, therefore, put in place infrastructure that will organise the market into a tangible physical point where someone can be seen, engaged and issues addressed. I urge this House that as we look into it this is something that we must embrace since it is the way the world is going. If big economies like the United States, United Kingdom and South Africa in Africa, which is an economy we can refer to within our African boundaries have adopted it, Kenya should be proud that we have opted in as the fourth in line. We should adopt it, encourage and onboard many people to invest in a secure manner. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Kesses, UDA",
          "speaker_role": "Hon. Julius Rutto",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The only challenge we ought to speak about is to encourage the CBK to up its game and undertake sufficient research because the risk that has come out of this discussion is how our economy will be protected and the value of our currency, the fiat money that we transact with. Those are some of the issues CBK needs to up its game so that it can protect our legal tender. The current exchange rate between the dollar and Kenya shilling has stabilised at around Ksh128. We should look at how we shall stabilise our currency as we go the virtual way. We are all aware that the other day the Cabinet resolved that there will be no more creation of authorities. The Virtual Asset Service Providers Bill will establish an authority to manage these assets, besides the CBK and CMA that have been managing the security markets in terms of shares, bonds and treasury bills. This sector has a unique characteristic that will require a unique board or authority with sufficient technical knowledge to manage. This authority will require knowledge from CMA, CBK and Financial Reporting Centre (FRC) for the sole purpose of organising the market well and protect consumers. We should not forget that recently we passed the Anti-Money Laundering and Combating of Terrorism Financing Laws (Amendment) Bill in this House that was signed into law. The law ensures that the virtual assets sector cannot be misused to conduct money laundering that I have heard someone calling wash wash to transact illegal money from another country. These are issues that have to be looked at so that we avoid issues to do with money laundering through this particular asset. I support this Bill and appreciate my Chairman for providing leadership, Hon. Kimani Ichung’wah, and my colleague Members of the Committee. It was a very difficult subject, but I am happy we are here. However, I need to note that we had a challenge. I appreciate our team of legal staff. The drafters of this Bill, the National Treasury gave us a Bill that would make you sorry. I do not know who drafted it. I am not aware whether the Attorney-General looked at it or not. It had many repetitions, inconsistent words and words that could not be legalised. During the Committee of the whole House when the Chairman will be moving, we will note and appreciate amendments in almost all clauses. We urge them to prepare Bills well before they submit them to this House. It is a lot of work to redraft a Bill instead of looking at the issues raised by stakeholders and moving forward with a Bill that is well organised. Thank you very much, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The Whip of the Minority Party followed by Member for Endebess.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie Odhiambo-Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you Hon. Temporary Speaker for giving me this opportunity to contribute to this Bill. I thank the Leader of the Majority Party for bringing this timely Bill. The Leader of the Majority Party indicated when moving the Bill that virtual assets are digital presentations of value that are capable of being traded or transferred. Because they are not physical assets, there are many issues that are likely to arise. Some of the things that Members have said is the heightened risk of money laundering, terrorist financing, fraud, market manipulation and operational and cyber security vulnerabilities. There is also the issue of lack of regulation which I am happy that with this The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie Odhiambo-Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "law there will be an aspect of regulation. Another issue is the market and operational risks that include price volatility and as I had indicated, the issue of cyber security. I will comment very briefly on some of the things that this Bill speaks to. It designates a regulatory authority, which is a very good thing. This is because this is a sector that is not aptly regulated. Because of that, it becomes very difficult to differentiate between legitimate virtual assets operations and what has come to be known in Kenya as wash wash . There are many people who after getting money under very questionable circumstances suddenly want to be elected to Parliament and get into positions of authority where they presume they will hide their money. The other good thing that this Bill does is to provide licensing requirements so that it is not a free-for-all. Through licensing, we will know who we are dealing with and this will enable us deal with the cyber threats we are talking about. I am happy that Clauses 21, 22, 23, up to 24 of this Bill talk about ethical issues such as businesses to be conducted in a prudent manner with integrity and issues of conflict of interest. Another notable issue is that it also provides for criminal offences and penalties for people who misuse this platform. When we passed the Data Protection Act, I thought we were being melodramatic. I understood why there was need for data protection last year when we had the Gen Z issue and my number was shared. I got messages and calls every hour despite the fact that I was not considered bad but rather a favourite at that time. I wondered if I was a favourite and I got that kind of messaging, what about those who were not liked? I was forced…",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Like the Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie-Odhiambo Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes. I was forced to get a temporary new number because I could not cope. I hired a Gen Z to manage my phone and paid a monthly salary. After a month, he returned my number and told me, “you, your money and phone, I cannot deal.” Look at the case of Albert Ojwang’s father. He was talking about money disappearing. We are almost talking in the virtual space. We are not talking about hard currency. If you wanted to steal my money in the past, you needed to get a gun, get where the money was, and shoot. Since we are dealing in a different era, it becomes very easy for somebody just to know how to tweak things and steal from you. We have an amazing number of highly educated young people in Kenya. Many of them would benefit if we regularised use of virtual assets and they could work within the sector. As we move forward technologically, the challenge is that we risk leaving certain areas behind particularly rural areas like my constituency. People there have no clue what you are talking about when they hear people talking about virtual assets. We still use the hard currency. I would like to encourage the Committee to note that some of the things we are speaking to is ensuring technological equity so that we have more people engaging on these platforms and we carry everybody forward. I do not know whether the Committee has done it. I see the Virtual Asset Service Providers Bill is before us. I do not know whether the Committee considered calling it the Virtual Asset Service Providers and Users Bill. We should not only talk to providers but to users as well. You are speaking to users while talking about protecting people’s data and their virtual assets. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Suba North, ODM",
          "speaker_role": "Hon. Millie-Odhiambo Mabona",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I read the Bill halfway. I will propose amendments if there are any issues that I would need to look at. So far, the main concern I have identified is the need of technological equity and inclusion of users alongside providers. Otherwise, I thank the Committee. I also thank the Parliament of Kenya. Much as we are castigated many times, we are really ahead of many counterparts even across the world. I was invited to a conference in South Africa recently. They were talking about issues related to the Bill I am sponsoring. Although our Bill is still at the Committee of the whole House stage, I discovered that we are ahead of others. People are looking up to Kenya. One lady shared with me that they attempted to draft a similar Bill in Nigeria, only to realise it was my Bill word for word. In fact, they forgot until they used terminology that was clearly Kenyan. The person who was reviewing the Bill said, “This is not Nigerian. This is Kenyan”. The systems were clearly Kenyan. I laud us as the legislative arm of Government for the excellent work we do. Similarly, we encourage the Executive arm not to fail us. Implementation must be just as effective as our legislative efforts once we put this law in place. I thank the Committee. I support the Bill.",
          "procedural_notes": []
        },
        {
          "speaker_name": "The Temporary Speaker (Hon. Farah Maalim)",
          "speaker_role": "Hon. Farah Maalim",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Pukose.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you. On the onset, I support the Virtual Asset Service Providers Bill. For the comfort of Hon. Millie Odhiambo, I want to let her know that Uganda is also benchmarking from her Assisted Reproductive Technology Bill. Kenya is doing very well. Nigeria failed on the anti- snake venom but Kenya is on the way to achieving that. This is a very important Bill. Conmanship is one of the major challenges of service provision in the virtual assets sector. I would like the Committee to make it simpler because Kenyans should not fear venturing into this field. When complicated, it becomes something for elites instead of farmers. We moved to buying tokens even for our electricity. You can easily purchase more electricity tokens when they run out. Similarly, in the virtual assets space, you can earn points, and even transfer tokens to someone else to help them buy food or pay school fees. This is not a new concept but explaining it to others is a challenge. We are speaking about cryptocurrencies such as Bitcoin and Ethereum and the management of the virtual assets field. In other jurisdictions, the regulator must ensure that any service provider in that field is a resident and has a permanent address within the country. That helps build confidence in the citizens so that they know the virtual asset service provider. Part IV of the Bill outlines the requirements that a service provider must meet. This is important because if I am entrusting my money to you to trade in that space, I need to know that my investment is safe, whether it is in Bitcoin, Ethereum, or any other asset. The Committee originally proposed to assign regulatory authority to either the CBK or the CMA. However, the Committee Report proposes the establishment of a Virtual Assets Regulatory Authority. The CBK and CMA already have other responsibilities. They may not be able to manage this space very well. We need a body that can regulate this space and be held accountable. You cannot hold the CBK or CMA accountable due to ambiguity. Part III of the Bill is on the licensing requirements. Clause 10(4) states that the Cabinet Secretary may, by notice in the Kenya Gazette, amend the First Schedule to this Act. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Endebess, UDA",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "How can a Cabinet Secretary amend a schedule that has already been passed by Parliament? Any such amendment should be brought before Parliament, perhaps through a Statute Law (Miscellaneous Amendments) Bill, and not via a gazette notice. Suppose you make an amendment that will result in the loss of people’s resources? That will make the market unstable. That kind of mischief should not be included in the Bill. The Bill also touches on mitigation of risks associated with money laundering and terrorism financing. Virtual assets are not a form of money laundering. Trade in virtual assets happens in other countries. It is an internationally recognised business. Kenya is the fourth country in Africa to have a law that governs that space. We are on the right track. I urge Members to support the Committee amendments once they are brought to the House. We must pass a law that builds public confidence in trading in virtual assets. I support the Bill.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Member for Wajir North, followed by Hon. Mayaka.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. This Bill is very technical and creates challenges, both in terms of regulation and implementation. Looking at the legal aspect, our Judiciary is challenged with regard to Information Communication Technology (ICT), considering how election petitions are managed. The Bill raises similar concerns. Unless the knowledge gap in ICT improves, successful implementation and regulation of this law will be a serious challenge. We also have to deal with perception issues. Virtual assets are abstract assets whose value is represented digitally. We are talking about a very key thing, an asset whose value is digitally represented. That is a major concern. It is worse when you trade with an asset that is digitally valued and represented. I am sure that presents a serious concern and becomes an impediment to trade. We are talking about perceived value, not actual value.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Assets based on perceived value have their challenges. I am a pastoralist. We do not have credit balances in conventional accounts. Our wealth is on the hooves, in the number of cows and camels we have. When you expose us to another world, another economy where wealth is thought of in billions, which is abstract to us, there will be a serious gap. This is a pastoralist participating in cryptocurrency in a digital world. However, if well implemented, and if the pastoralist community is brought up to speed through capacity building, it can offer serious benefits and help manage the risks. We have been solely dependent on one mainstream livelihood: livestock keeping. I am sure that with this, we will diversify our economy as pastoralists. We will be able to access markets in a unique way, if only the educational gap is addressed. We are talking about accessing markets beyond livestock markets and accessing digital financial services. Already, pastoralists use mobile money services such as M-Pesa on their small phones, which act as a form of saving. When they lose livestock, they at least have some money in their M- Pesa accounts. If this is well done, we will take it a notch higher. Pastoralists will be able to access insurance products on digital platforms, if properly done.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The compound effect of this is that we will be able to mitigate the impacts of drought, diseases and cushion livestock from market fluctuations. However, if implemented, this issue is laden with bigger risks. As I said, I am a pastoralist. I live in a physical world where I want to feel my asset. This is my camel or my cow, and I enumerate them by number but here we The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "are talking about billions, colossal amounts of wealth, that are not visible to us. One of the key risks is volatility in value. Today, you may be told your asset is worth Ksh1 billion. An hour later, things change. When you talk about assets with regulated volatility, you begin to question the value of your asset. Is it worth investing in such a volatile business? Security is another issue. There is so much vulnerability. Regulating it is cumbersome and very expensive. As a country, are we truly prepared at that level, in terms of ICT knowledge, to ensure security? Can we ensure that security risks are managed and controlled?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, then there is the theft of keys or what they call passwords. These can be hacked or stolen. For instance, you sell all your camels, invest in the digital economy, and the next day you are told your keys have been stolen and all your assets are gone. You have to start from scratch. We have that challenge. There is also the issue of fraud. Some countries are too advanced that they can transfer all your money from your account to theirs. Fraudsters and scammers must be dealt with in a serious way. There is also the issue of illicit activities. We used to talk about money laundering to finance terrorism.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "On a point of information, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Saney, would you like to be informed by the Chairman of the Committee?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Yes. I prefer that, only that I fear being distracted in terms of continuity. I accept, Sir.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, I would like to inform Hon. Saney. I am really liking the contribution he is making and that is the whole objective of this Bill: to regulate that particular space. When a pastoralist sells his cows and trades in these virtual assets and loses all their money and has no recourse, this Bill, once passed by this honourable House, will provide a legal framework. The pastoralist can recover their money through the measures set out in this Bill. Thank you, Hon. Temporary Speaker.",
          "procedural_notes": ["(Hon. Ibrahim Saney spoke off the record)"]
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "For the interest of the Chair, does that include the volatility in the markets? The stock exchange is volatile in the sense that today the share price of a company in which you invested in the USA or the UK could drop tomorrow by 50 per cent. Does that cover you against that volatility? Will the provisions in the piece of legislation we are making right now cover those market dynamics?",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary Speaker, one of the things that affect the volatility is facts like what we call insider trading, which has strictly been prohibited by this. We have also provided for fiat-based digital currencies, where that virtual asset is backed up by a physical asset. Therefore, that volatility is controlled in that sense. Some technologies, for example, allow that once you buy a stable coin, you are given a key to keep it in a safe somewhere and you can use it later. We have put enough measures to make sure that those fluctuations in prices and vulnerabilities can be taken care of by preventing The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Molo, UDA",
          "speaker_role": "Hon. Kuria Kimani",
          "speaker_url": null,
          "speaker_details": null,
          "content": "insider trading, recognising stable currencies now and having a fiat-based virtual asset and physical asset-backed digital assets.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Wajir North, UDA",
          "speaker_role": "Hon. Ibrahim Saney",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Temporary, from the beginning, I have appreciated the novel thinking that went into this Bill. However, what I am questioning is the timing and practicality. I represent the owners of livestock. I am a camel herder myself, and I also keep cows and goats. How do we interface the pastoralist economy with this digital economy? That is my concern. All I have been proposing are the inherent risks that may kill this wonderful idea if they are not addressed. Knowledge gap is another issue. Forget about the pastoralists, 80 per cent of the common Kenyan, the hustler, needs to understand this before we even talk about the asset. I am afraid we are developing a Bill for a monopoly, for one or two providers, which is a kind of monopoly similar to what we had with the Kenya Posts and Telecommunications Corporation (KPTC). We are better off now because we have Safaricom and other companies these days. It is like people sitting down and trying to come up with a Bill that only benefits one or two entities. I am sorry that my time is up. Lastly, there is lack of traditional investor protection. Initially, we used to have collateral and other things. Even insurance companies will be at pain to cover this kind of business. Therefore, if those challenges are addressed, if our concerns from a pastoralist’s eye can be handled, the idea is good and progressive, but it may die because of practicality. I reluctantly support.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I stand to support the Virtual Assets Service Providers Bill (National Assembly Bill No.15 of 2025). I am elated that we finally have this Bill in place. The Chairperson of the Departmental Committee on Finance and National Planning will remember that earlier last year, I sought a statement on recognition of cryptocurrency as a legal tender in this country. This Bill is important because it not only covers cryptocurrency but all other virtual assets, including gaming tokens, governance tokens, and non-fungible tokens (NFTs) which are quite popular.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I want to make a comment particularly to the Member who just spoke. If you compare virtual assets and the direction the world is taking, in some countries people are buying air tickets with cryptocurrencies and other tokens. It does not mean you cannot convert your traditional assets into cryptocurrencies or virtual assets space. As a country, we should not be averse to new things and innovations. Rather, we should embrace them. What we are doing is creating a safe space.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "As many Members have already noted, Kenya is currently a hotspot in terms of virtual assets. It is ranked fourth amongst African countries trading in this space. Many Kenyans are trading in virtual assets. The 2024 CBK survey shows that a third of banks, especially those in the top tier, are ready for this activity. The only thing they require is a legal framework to operate within. Also, the 2024 chain analysis report ranks Kenya among the 21 out of 155 countries ready to adopt virtual assets.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Looking at the specifics of this Bill, it seeks to prevent money laundering, terrorism financing and fraud. The lack of a legal framework has made many people averse to this space. This Bill will address that. Part II of the Bill speaks about designation of regulatory The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "authorities. We already have regulatory authorities for traditional assets. It is encouraging that virtual assets will now be incorporated for regulation. This means we do not have to reinvent the wheel. We can simply plug and play the existing regulatory systems. Part III of the Bill speaks about licensing requirements. Licensing has been a thorny issue to navigate for virtual assets suppliers. Many have been operating independently, using regulations from other countries but do not align with Kenya’s context. Having our own licensing framework will be a major step forward. Part IV of the Bill addresses general obligations of virtual assets providers. Part V focuses on prevention of money laundering. This is important because concerns about fraud and anti-money laundering have made people to shy away from investing in this space. This Bill creates an environment that will encourage their participation.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nominated, ODM",
          "speaker_role": "Hon. Irene Mayaka",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I want to echo what Hon. Millie has said before. This Parliament has passed several legacy laws not only for the present but also for the future. This Bill is particularly important not only for regulation but also for investor protection. We are not only looking at suppliers of virtual assets but also users of the assets. Again, in client asset segregation, when you are choosing to invest or save in a particular environment, it is always advisable to invest and save in different environments. As I conclude, I have seen and taken note of the public participation concerns and suggestions that were given by nine different organisations that submitted structured memoranda to the Committee. It is very helpful information. I have also noted that the Committee has taken them up to be included in the amendments. I join the Hon. Pukose in talking about the Virtual Assets Authority. I feel this is a very important aspect that will need another law to be put in place. This will enable us to give the required authority regulators to assist and strengthen this noble idea. For me, what is most important is having a sandbox policy, for example, the CMA has a policy on sandbox regulation. Sandbox regulation assists in having a live test environment to test any new innovations and technology in whichever space for virtual or traditional assets. What is going to be very important, and I hope the Chairman of the Departmental Committee on Finance and National Planning is listening to this, is that when we come up with the Virtual Assets Authority, we should include the sandbox regulation so that it can have the required strength. Hon. Temporary Speaker, I am thankful to the Committee for bringing this very important Bill to the House. I hope Hon. Members will support and pass it. With those few remarks, I support. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Keynan followed by Hon. Esther Passaris.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Eldas, JP",
          "speaker_role": "Hon. Adan Keynan",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. As I reflected on what to say on this very important Bill generated by my former Committee, I went back to my dictionary and looked at Maslow's Hierarchy of Needs. In that particular diagram, the highest level is self-actualisation. In the Kenyan context today, Hon. Temporary Speaker, you and I are still struggling even to define the traditional financial system dominated by fiat currencies. But for other Kenyans, by the grace of our democracy, have moved ahead. I just want to look at the structure of the Kenyan society, the kind of representation and face that we have. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Eldas, JP",
          "speaker_role": "Hon. Adan Keynan",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Right now, we have moved from the traditional financial asset system dominated by fiat currencies to this virtual asset system that will be dominated by cryptocurrencies, non- tangible tokens, gaming tokens, government tokens and many other activities that are Greek to you and me, who represent a traditional society. This is very good and progressive. However equally, we must also be very careful not to ape what other people have done. We must legislate to conform to the societal needs of the people we represent. That is critical because that is the work of a legislator. I appreciate my young brother here, Hon. Kimani, my former Chairman. He is one astute sharpshooter financial expert. But reflecting on Maslow's Hierarchy of Needs, we are in a completely different world. So, I am conflicted. Should I legislate for the good people of Eldas and bring them to the level of the other Kenyan society? That is why the framers of the current Constitution put an article called Equalisation. Equalisation is doomed and we know it. It has been wasted by groups who have never been sympathetic. When I look at this concept, I find it very good. It will bring about decentralisation and stock market transaction; it will bring about transparency and pseudo-anonymity, where you hide your identity. For example, Farah Maalim will be trending, but nobody will know, and Farah Maalim will be dominating the virtual assets market, but nobody will know. Nobody can see your identity. This is good for protection. However, it can also bring about serious volatility because you do not know the dynamics and you are not in charge. Hon. Temporary Speaker, as we go through this Bill, we also need to look at the regulatory aspects. We have invoked the CMA. I took a bit of time to look at their roles and that of the CBK. They have completely different functions. For avoidance of doubt, the role of CBK is to: 1. Formulate and implement monetary policies. 2. Manage national currency. 3. Supervise and regulate financial systems. 4. Act as a banker of the national Government. 5. Promote financial stability. The role of CMA is to license and supervise market intermediaries that are the different players within the financial system, in their competition, regulatory framework and models of branding. They also look at and promote market products. That is why people compete for a viable, predictable and well-regulated capital market. They also protect investors who trade in bonds and stocks. Having reflected on this Bill, I am persuaded that the right regulatory framework is neither CBK nor CMA. We need to have another agency because we will be trading at another level, where maybe our grandchildren only understand. I will take a bit of time to understand this. Actually, one of my children is a fervent trader of virtual assets. He gives me lectures sometimes. I am still hesitant to adopt this practice because I am not sure. I am a camel herder like Hon. Saney. I value my stock in the number of camels that I have. The Kenyan currency is just a new phenomenon. You have moved me to another level of cryptocurrency, yet I represent people. This must be put into perspective. My able Chairperson has done a bit of public participation, but he still needs to do more that will involve the Members of Parliament that will take us to the level that you are, so that we also appreciate it. Equally, this country is not short of legislation. Go anywhere in The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Eldas, JP",
          "speaker_role": "Hon. Adan Keynan",
          "speaker_url": null,
          "speaker_details": null,
          "content": "the world like Japan. The spatial system for Tokyo is borrowed from Kenya. It is the same in Jakarta and London, yet we do not apply the same here. We are very good in book-worming and legislating. However, when it comes to the actual implementation, we degenerate. This Bill is good. Can we dissect it further so that we do not just legislate for a clique of the super- rich whose richness can also be questioned? You know them.",
          "procedural_notes": ["(Applause)"]
        },
        {
          "speaker_name": "Eldas, JP",
          "speaker_role": "Hon. Adan Keynan",
          "speaker_url": null,
          "speaker_details": null,
          "content": "If we ask them to account for their wealth, very few of them can do it, yet they remain a critical component of the society. That is why we are not developing. The Bill is too generous. In legislation, we must be very careful to legislate for a particular short-term phenomenon. The rich want to circumvent the due process which is clearly established by the existing institutional framework. Any Bill that touches on the financial system of a country must be security tight and properly moderated because a small mistake can cause financial havoc. Without this, the next things are inflation, high cost of living and unpredictable financial consequences. That is why we must be very careful. These are the bits I have borrowed from this book. I am going to subject this Bill, and the different contexts therein, to one critical consultant, who is also a friend of my former able Chairman. He will look at it further and see the amendments that we can introduce so that the Bill becomes beneficial for everybody. The most developed economies, like America, are struggling to define cryptocurrency. I have followed the debate in Turkey. Turkey is the seventeenth-largest economy in the world. They are yet to find a description of whether it is legal, financial or political. Chairman, and good Committee Members, this is a good first step. Can you now begin thinking about the other aspects of this Bill, so that we do not draw our country into a global phenomenon, for which we are not properly prepared? Finally, our work is to legislate. We are leading a struggling community. The Kenyan community is struggling right now. They are overburdened by circumstances beyond their control, and you know it. And we are their representatives. Everything that we do must consider their well-being. Their well-being is about basic needs and how to overcome the day-to-day struggles. Their basic needs include how to take their children to school, access decent transport, and obtain decent shelter. All these matters must be part of our collective legislative framework. Broadly speaking, I support. Specifically speaking, there is need for further research. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Esther Passaris.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nairobi City County, ODM",
          "speaker_role": "Hon. Esther Passaris",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I rise to support the Bill, but also urge this House to strengthen it. Concerns raised by Hon. Keynan are genuine and must be addressed. We have seen, first-hand, what happens when digital finance operates without oversight. Crypto Bridge Exchange (CBEX), a so-called cryptocurrency platform, promised and guaranteed returns using flashy language and artificial intelligence trading bots. It lured thousands of Kenyans, many of them young people and first-time investors, and then one day it vanished. It left behind a trail of financial ruin, and no one was held accountable. I was one The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nairobi City County, ODM",
          "speaker_role": "Hon. Esther Passaris",
          "speaker_url": null,
          "speaker_details": null,
          "content": "such investor in the CBEX platform. Tomorrow is the day that many young Kenyans, who invested in CBEX and were able to pay the US$100, were told they had to pay to recover their money, and to verify their accounts, are waiting to make withdrawals of their principal amounts. When I got into the CBEX platform, introduced by a young Kenyan, I found Kenyans who were speaking very highly of it. They had made big money. I have a friend called Lydia, who I met on the platform. Lydia managed to educate her children and even bought her mother a house, all through crypto. Others are actively trading in crypto, and are the same people who buy or sell crypto using the Binance platform. Unfortunately, because there is no regulation and there is no law, sometimes when their bank accounts are hit with large sums of money, they are frozen. Then they have to go around trying to find paperwork and appease the banks. But then again, there is a vacuum that allows people to operate in the wrong way instead of the right way. As we strengthen the law, let us find a mechanism to protect the consumer. Let there be a compensation fund, contributed to by all Virtual Asset Service Providers, so that when a platform collapses or commits fraud, Kenyans might have a form of recourse. Let us prohibit the advertisement of guaranteed returns or unverifiable artificial intelligence claims that mislead the public. If you go to Facebook right now, you will see numerous AI-generated adverts showing former President Uhuru Kenyatta, saying, ‘I found a way for Kenyans to make money. Invest Ksh32,000, and you will get a return of Ksh500,000.’ Hon. Temporary Speaker, I have seen them shamelessly using the sitting President. They use a media personality in an interview and thereafter show the current President sitting on a chair appealing to Kenyans to invest in this platform. I warn Kenyans that most of these things are fraudulent. These are people trying to scam you. Be very careful to avoid being scammed by AI generated advertisements. It is very dangerous. The law and the Bill also have to prohibit advertising of guaranteed returns or unverified AI claims that mislead the public. We also need to tackle pyramid, style and referral schemes that disguise as investment opportunities. China Beijing Equity Exchange (CBEX) was one such scheme where people were recruiting others. It was not for trading, transparency, and innovation, but exploitation. The Bill needs to incorporate a financial reporting centre that can publish a blacklist of unlicensed platforms and protect whistleblowers who come forward with information. The Bill should ensure they are not silenced. Many of these schemes operate across borders. The Bill should also include provisions for international cooperation with bodies like the International Criminal Police Organisation (Interpol) and Nigeria's Economic and Financial Crimes Commission (EFCC) to trace and recover stolen funds. If we cannot do that, people will lose money when they join these online platforms even though we have laws in Kenya. Lastly, we must also require annual audits and quarterly disclosures. We should enforce the know-your-customer rules to prevent anonymous abuse. The public deserves absolute transparency. Finally, Hon. Temporary Speaker, let us commit to public education on virtual assets. Innovation is welcome but only when Kenyans are equipped with knowledge and protected by law. The Bill should not only enable the future of finance but must also defend people The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Nairobi City County, ODM",
          "speaker_role": "Hon. Esther Passaris",
          "speaker_url": null,
          "speaker_details": null,
          "content": "from its worst abusers. Let us ensure that what happened with CBEX and many other collapsed platforms that have created fear in our community never happens again. With these critical amendments, I support the Bill. Since I still have time, let me say something before I sit down. Tomorrow is 25th of June. It is the anniversary of the Gen Z uprising of last year. I have seen so many videos and calls for people to come out and demonstrate. My county always ends up with bloodshed, people losing their property and politicians mobilising people to exploit their poverty. I appeal to Kenyans because I have heard them. We are all very sympathetic towards all the families who lost their loved ones during the Gen Z uprising last year. The country will do whatever it takes to ensure we have reparation. The country will also do whatever it takes to ensure we have the police reforms we need. Many Gen Zs say that the memory of 2024 should never die. However, I want them to understand something. They might have lost their confidence in politicians or in the Government on online platforms. However, not all Kenyans have lost confidence in Government. As representatives of the people, we are serving Kenyans out there. Gen Zs cannot lose confidence in God Almighty. There is something wrong with their movement if they have lost confidence in God Almighty. While they say they are leaderless, I want to offer them leadership. If it is really for the memory of those who lost their lives, if it is really for the desire to have a well-governed country, why not occupy churches, temples and mosques tomorrow and pray to the Almighty for the lost souls? It should not just be for those who lost their lives during the Gen Z uprising but throughout the struggle for Independence and a well-governed country. They show that they are a peaceful lot if they do that. They should not be infiltrated because one right cannot negate another. You actually negate the right of people to do their business when you come out to demonstrate. All the businesses in my county end up closed and unable to trade. The businesses lose profits and employees lose jobs. Why should rights of Gen Zs be prioritised over those who actually require jobs and make profits? The Government needs taxes. My appeal is that if we are sincere that we care for the future of this country, having lost confidence in the Government as people have said with chants of “Ruto must go” – he is not going anywhere because he was constitutionally elected to serve in that position – the Gen Zs should occupy our spiritual spaces peacefully and pray for the nation. We cannot say that we have lost confidence in God who provides the life that we are fighting to protect. My appeal to the police tomorrow is… I know that the police are sometimes challenged. I see the Gen Zs taunting them. We should remember that we have one policeman for 500 plus citizens. Tomorrow we should have respect for the law that we say is not serving us. I appeal to Kenyans tomorrow to come out and pray for the nation and demonstrate peacefully. I also ask the police to exercise restraint so that no other life is lost tomorrow. I support. Thank you.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Naomi Waqo. She will be followed by Hon. Nyikal and Hon. Jematiah.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker for allowing me to add my voice to this very important Bill, the Virtual Asset Service Providers Bill. I want to congratulate all the Members of Parliament who have contributed to The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "the Bill. I want to confirm that I support the Bill. It is a forward looking and transformative piece of legislation. The world is growing very fast. It is becoming a small village and we cannot be left behind as a country. The young people of this country are very creative, innovative and passionate, and they are moving faster than us. That is why today I support the Bill. It balances the need to embrace technology and innovation with responsibility of safeguarding our financial system. Any investor will want to be assured of safety. He will want to know that his investment is well safeguarded. The Bill is providing that. As we know, Kenya is leading in many areas, especially in this region where we have been leading and we will continue to lead. We want to be always leading from the front and to be a good example to others. Once this piece of legislation is operationalised, we will set a good example in the region. We will continue to invest and encourage our young people so that we can grow as a country. The Bill enhances financial inclusion. That is what Kenyans want. Even if financial inclusion is there, we must make the Bill relevant to every part of this country. Some of our business people are not well educated and may not be exposed to technology. If we can do capacity building and create enough awareness on this Bill by educating Kenyans, it will be of great benefit to us as a nation. The Bill will streamline cross border remittance and drive digital investment. It is the only Bill that can promote our M-pesa today. We are already doing very well as a country and we are proud of our young investors who came up with the M-Pesa idea. As a result of that, even if you are in the remotest part of this country today, as long as there is good network, you can transact with M-Pesa and do business. Before, as politicians, we used to struggle because we could not always have enough cash. Today, with M-Pesa, you can easily do your transactions. You can access your money regardless of where you are.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "We also know very well that Kenya has increased adoption and use of virtual assets, particularly in payments and investments. We need to promote and grow this so that, from the comfort of your house, you are able to transact business. Sometimes, even when business people are in hospital beds, they can do many things as long as they are in their senses, something that was impossible previously.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Our young people are very innovative, but the majority of them are unemployed. This Bill will give them hope and the opportunity to get employed. Our role is to make sure that we give every Kenyan an opportunity to know about this Bill and put it into action.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "As I conclude, I echo Hon. Passaris' noble call to the nation. That is what we all need to do as a country. As I meditate on 25th June 2024, and putting into consideration what might happen tomorrow, my heart is troubled. As a mother to teenagers, and looking at the spirit that is in our nation, I sympathise with the young generation of this country.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "I want to say that I know our young people are fighting for their rights, and the Government is giving the best to the nation. Our President is working day and night to revive our economy, and your parents are working very hard. Tomorrow, you might go to the streets and lose your lives. We will cry and mourn you. My humble request is that you look at the many ways you have to demand your rights and ask the Government what you want. You cannot say that you are tired. O our Government is listening, and as your parents and leaders, we are here for you. We are ready to listen and dialogue with you. Let us not lose more lives. Let us respect the rule of law and pray for this country. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Marsabit County, UDA",
          "speaker_role": "Hon. Naomi Waqo",
          "speaker_url": null,
          "speaker_details": null,
          "content": "We cannot afford to lose our country. God has always been there for us. We have enjoyed the resources that God has given us, and it seems like we are ready to destroy them. We cannot afford to do that. We love you and celebrate you, our young people. Unfortunately, we lost many people, but let us not lose more in the planned demonstrations. I pray that you will not be misled, that you will sit, reason, and see how best the Government can serve you. With those few remarks, I support the Bill. Thank you, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. (Prof.) Nyikal.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Seme, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you, Hon. Temporary Speaker. I rise to support this Bill and give a bit of caution. Today, we talk of E-commerce, digital currency, virtual assets, and we are already doing virtual money transfers. We are setting up digital hubs in our constituencies to enable our young people to earn some income. The revolution in the economy and commerce is upon us, and our youth have deeply invested in this. They create TikTok videos digitally and receive their payments virtually. We cannot ignore this revolution. The reality is that some individuals are involved in the digital assets market as both providers and consumers and are earning from it. The sad bit about this is that we lack regulation in this sector. This trend is not going to stop anytime soon. I support this Bill because it provides for the regulation of the sector. The CBK has cautioned us about these virtual assets but has not deemed them wrong. This Bill establishes a regulatory framework, identifying the necessary authorities, though many of us feel we need to set up a specific authority. We can discuss this further in the Committee of the whole House. The Bill also outlines licensing requirements, detailing who does what, where, and how, which is necessary. It addresses the risks associated with cyberspace, such as money laundering, financing terrorism, fraud, data protection, and cyber security. Hon. Temporary Speaker, we live in a country with two layers of people. Some people are left behind. Public education is extremely important in this area. My mother and peers, and even some of us, are not engaged in the digital world. We need to bring them in. Even with regulation, this group remains at risk of being conned. We must educate them. Additionally, we need to ensure we have effective internet infrastructure. I am particularly concerned because I supported the University Funding Model in principle. Universities should be supported based on their numbers and courses. Where we went wrong is in lacking the internet infrastructure needed for means testing, which caused the incorrect bands. The Chairperson is present and I hope that we will put in place a proper education system for the public for these virtual assets. When we introduce these new ideas, we are not the target audience because we can educate ourselves. Our focus should be on the people in rural areas. How will they be connected and how will they benefit from this? Currently, we have issues in the social protection department with the elderly accessing their funds. We even provide them with phones, yet they still struggle to access their money. We need to educate the people from the ground up. This approach will take the country far. If we do not educate them, then this initiative will fail. If only a few people are using it, and even if they face challenges, interest will wane. The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Seme, ODM",
          "speaker_role": "Hon. (Dr",
          "speaker_url": null,
          "speaker_details": null,
          "content": "This is a good Bill and I support it. However, public education is key to its success. Thank you, Hon. Temporary Speaker.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Next is Hon. Jematiah. We have less than a minute, but you may proceed.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Jematiah Sergon (",
          "speaker_role": "Baringo County, UDA",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Baringo County, UDA): Hon. Temporary Speaker, I can take this up in the next Sitting because I have a lot to say.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "No. Just start, and you will have the time when the debate resumes.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Baringo County, UDA",
          "speaker_role": "Hon. Jematiah Sergon",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Thank you very much, Hon. Temporary Speaker. I also rise to support the Virtual Asset Service Providers Bill. As most Members have spoken before me…",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Jematiah, you have only used 10 seconds. You will have nine minutes and 50 seconds when debate on the Bill resumes.",
          "procedural_notes": []
        }
      ]
    },
    {
      "section_type": "ADJOURNMENT",
      "title": null,
      "contributions": [
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "Hon. Members, the time being 7.00 p.m., the House stands adjourned until Wednesday, 25th June 2025, at 9.30 a.m.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The House rose at 7.00 p.m.",
          "procedural_notes": []
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": [
            "Published by Clerk of the National Assembly Parliament Buildings Nairobi"
          ]
        },
        {
          "speaker_name": "Hon. Farah Maalim",
          "speaker_role": "The Temporary Speaker",
          "speaker_url": null,
          "speaker_details": null,
          "content": "The electronic version of the Official Hansard Report is for informationpurposes only. A certified version of this Report can be obtained from the Hansard Editor.",
          "procedural_notes": []
        }
      ]
    }
  ]
}
